Repository: KDE/kommit
Catalog: po/*/kommit.po
Languages: ar, eo, fi, fr, he

source: <html><head/><body><p>Change cr/lf or not</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-coreautocrlf"><span style=" text-decoration: underline; color:#007af4;">More information...</span></a></p></body></html>
ar: <html><head/><body><p>غيّر cr/lf أم لا</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-coreautocrlf"><span style=" text-decoration: underline; color:#007af4;">مزيد من المعلومات...</span></a></p></body></html>
he: <html><head/><body><p>האם להחליף cr/lf או לא</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-coreautocrlf"><span style=" text-decoration: underline; color:#007af4;">פרטים נוספים…</span></a></p></body></html>

source: File mode:
ar: وضع الملف:
eo: Dosierreĝimo:
fi: Tiedostopeite:
fr: Mode du fichier :
he: מצב קובץ:

source: <html><head/><body><p>Tells Git if the executable bit of files in the working tree is to be honored. </p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-corefileMode"><span style=" text-decoration: underline; color:#007af4;">More information...</span></a></p></body></html>
ar: <html><head/><body><p>أخبر Git ما إذا يجب احترام بت القابلية للتنفيذ للملفات في شجرة العمل.</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-corefileMode"><span style=" text-decoration: underline; color:#007af4;">مزيد من المعلومات...</span></a></p></body></html>
he: <html><head/><body><p>אומר ל־Git אם חלק ההפעלה בעץ העבודה יכובד. </p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-corefileMode"><span style=" text-decoration: underline; color:#007af4;">פרטים נוספים…</span></a></p></body></html>

source: View
ar: عرض
eo: Vido
fi: Näytä
fr: Visualiser
he: תצוגה

source: Process finished
ar: انتهى المعالجة
eo: Procezo finita
fi: Prosessi valmistui
fr: Processus terminé
he: התהליך הסתיים

source: The git process crashed
ar: تعطلت معالجة git
eo: La git-procezo paneis
fi: git-prosessi kaatui
fr: Le processus git a planté
he: תהליך ה־git קרס

source: Process finished with error
ar: انتهى المعالجة بخطأ
eo: Procezo finiĝis kun eraro
fi: Prosessi päättyi virheeseen
fr: Processus terminé avec une erreur
he: התהליך הסתיים עם שגיאה

source: %1: (Elapsed time: %2)
ar: %1: (الوقت المنقضي: %2)
eo: %1: (Pasinta tempo: %2)
fi: %1: (kulunut aika: %2)
he: %1: (זמן שעבר: %2)

source: Run command
ar: شغل الأمر
eo: Ruli komandon
fi: Suorita komento
fr: Lancer la commande
he: הרצת פקודה

source: Output
ar: المخرجات
eo: Eligo
fi: Tuloste
fr: Sortie
he: פלט

source: File name
ar: اسم الملف
eo: Dosiernomo
fi: Tiedostonimi
fr: Nom de fichier
he: שם קובץ

source: Search in repo
ar: ابحث في المستودع
eo: Serĉi en deponejo
fi: Etsi lähteestä
fr: Chercher dans le dépôt
he: חיפוש במאגר

source: Path:
ar: المسار:
eo: Vojo:
fi: Sijainti:
fr: Emplacement :
he: נתיב:

source: Text:
ar: النص:
eo: Teksto:
fi: Teksti:
fr: Texte :
he: טקסט:

source: Search all branches
ar: ابحث في كل الفروع
eo: Serĉi ĉiujn branĉojn
fi: Etsi kaikista haaroista
fr: Chercher dans toutes les branches
he: חיפוש בכל הענפים

source: Search all commits
ar: ابحث في كل الإيداعات
eo: Serĉi ĉiujn enmetojn
fi: Etsi kaikista toimituksista
fr: Chercher dans toutes les validations
he: חיפוש בכל הקיבועים

source: Case sensitive
ar: حساس لحالة الأحرف
eo: Usklecodistinga
fi: Erota pien- ja suuraakkoset
fr: Sensible à la casse
he: תלוי רישיות

source: Search
ar: ابحث
eo: Serĉi
fi: Etsi
fr: Chercher
he: חיפוש

source: The selected branches must be different!
ar: يجب أن تكون الفروع المختارة مختلفة!
eo: La elektitaj branĉoj devas esti malsamaj!
fi: Valittujen haarojen on erottava!
fr: Les branches sélectionnées doivent être différentes !
he: הענפים שנבחרו חייבים להיות שונים זה מזה!

# @title:window
source: Select Branches
ar: اختر الفروع
eo: Elekti Branĉojn
fi: Valitse haarat
he: בחירת ענפים

source: Select branches
ar: اختر الفروع
eo: Elekti branĉojn
fi: Valitse haarat
fr: Choisissez les branches
he: בחירת ענפים

source: Select branch
ar: اختر فرعًا
eo: Elekti branĉon
fi: Valitse haara
fr: Choisissez une branche
he: בחירת ענף

source: HEAD
ar: رأس
he: כותרת (HEAD)

source: The path is not inside of git directory
ar: المسار ليس داخل دليل git
eo: La vojo ne estas ene de git-dosierujo
fi: Sijainti ei ole Git-kansiossa
fr: L'emplacement est en dehors d'un dépôt « git ».
he: הנתיב הוא מחוץ לתיקיית ה־git

source: The branch already exists
ar: الفرع موجود مسبقًا
eo: La branĉo jam ekzistas
fi: Haara on jo olemassa
fr: La branche existe déjà.
he: הענף כבר קיים

source: Unable to find the tag's target commit: %1
ar: عجز عن إيجاد إيداع هدف الوسم: %1
he: לא ניתן למצוא את קיבוע היעד של התגית: %1

source: Unable to create the branch: %1
ar: عجز عن إنشاء الفرع: %1
fi: Haaraa ei voi luoda: %1
he: לא ניתן ליצור את הענף: %1

source: Error switching to new target
ar: خطأ أثناء التبديل إلى الهدف الجديد
fi: Virhe vaihdettaessa uuteen päämäärään
he: שגיאה במעבר ליעד חדש

source: Tag
ar: وسم
eo: Etikedo
fi: Tunniste
fr: Étiquette
he: תגית

source: Tag name:
ar: اسم الوسم:
eo: Etikedo nomo:
fi: Tunnisteen nimi:
fr: Nom de l'étiquette :
he: שם התגית:

source: Commit(s) behind
ar: إيداع(ات) متأخرة
eo: Enmeto(j)n malaktuale
fi: Toimitus(ta) jäljessä
fr: Validation(s) derrière
he: קיבועים אחרי

source: Commit(s) ahead
ar: إيداع(ات) متقدمة
eo: Enmeto(j)n antaŭe
fi: Toimitus(ta) edellä
fr: Validation(s) devant
he: קיבועים לפני

source: Is ahead
ar: متقدم
eo: Estas antaŭe
fi: On edellä
fr: Est devant
he: האם הוא לפני

source: Ref
ar: مرجع
fi: Viite
fr: Référence
he: הפניה

source: (new commit)
ar: (إيداع جديد)
eo: (nova enmeto)
fi: (uusi toimitus)
fr: (Nouvelle validation)
he: (קיבוע חדש)

source: (content modified)
ar: (غير المحتوى)
eo: (enhavo modofita)
fi: (sisältö muuttunut)
fr: (Contenu modifié)
he: (התוכן נערך)

source: Message
ar: رسالة
eo: Mesaĝo
fi: Viesti
he: הודעה

source: Date
ar: تاريخ
eo: Dato
fi: Päiväys
he: תאריך

source: Graph
ar: مخطط بياني
eo: Grafiko
fi: Kaavio
fr: Graphe
he: תרשים

source: Author name
ar: اسم المؤلف
eo: Nomo de aŭtoro
fi: Tekijän nimi
fr: Nom de l'auteur
he: שם היוצר/ת

source: Author email
ar: بريد المؤلف الإلكتروني
eo: Retpoŝto de aŭtoro
fi: Tekijän sähköposti
fr: Courriel de l'auteur
he: דוא״ל היוצר/ת

source: Time
ar: وقت
eo: Horo
fi: Aika
fr: Heure
he: שעה

source: Head
ar: رأس
eo: Kapo
fr: Tête
he: כותרת (HEAD)

source: Tagger
ar: واسم
eo: Etikedanto
fi: Luokittelija
fr: Étiqueteur
he: מתייג/ת

source: Create time
ar: وقت الإنشاء
eo: Krei tempon
fi: Luontiaika
fr: Heure de création
he: יצירה

source: Tree
ar: شجرة
fi: Puu
he: עץ

source: Commits count by author
ar: عدد الإيداعات حسب المؤلف
eo: Nombro da enmetoj laŭ aŭtoro
fi: Tekijän mukainen toimitusmäärä
fr: Nombre de validation par auteur
he: מונה קיבועים לפי יוצר

source: Email
ar: البريد الإلكتروني
eo: Retpoŝto
fi: Sähköposti
fr: Courriel
he: דוא״ל

source: Autheds
ar: المصادقات
eo: Aŭtentig-redaktoj (autheds)
fr: Auteurs

source: Commits by hour of day
ar: إيداعات حسب ساعة اليوم
eo: Enmetoj laŭ horo de tago
fi: Toimitukset tunneittain
fr: Validation par heure de la journée
he: קיבועים לפי שעות ביום

source: Hour
ar: ساعة
eo: Horo
fi: Tunti
fr: Heure
he: שעה

source: Hour of day
ar: ساعة اليوم
eo: Taghoro
fi: Päivän tunti
fr: Heure du jour
he: שעה ביום

source: Monday
ar: الاثنين
eo: Lundo
fi: Maanantai
fr: Lundi
he: יום שני

source: Tuesday
ar: الثلاثاء
eo: Mardo
fi: Tiistai
fr: Mardi
he: יום שלישי

source: Wednesday
ar: الأربعاء
eo: Merkredo
fi: Keskiviikko
fr: Mercredi
he: יום רביעי

source: Thursday
ar: الخميس
eo: Ĵaŭdo
fi: Torstai
fr: Jeudi
he: יום חמישי

source: Friday
ar: الجمعة
eo: Vendredo
fi: Perjantai
fr: Vendredi
he: יום שישי

source: Saturday
ar: السبت
eo: Sabato
fi: Lauantai
fr: Samedi
he: שבת

source: Sunday
ar: الأحد
eo: Dimanĉo
fi: Sunnuntai
fr: Dimanche
he: יום ראשון

source: Commits by day of week
ar: إيداعات حسب يوم الأسبوع
eo: Enmetoj laŭ tago de semajno
fi: Toimitukset viikonpäivän mukaan
fr: Validation par jour de la semaine
he: קיבועים לפי יום בשבוע

source: Day
ar: يوم
eo: Tago
fi: Päivä
fr: Jour
he: יום

source: Day of week
ar: يوم الأسبوع
eo: Semajntago
fi: Viikonpäivä
fr: Jour de la semaine
he: יום בשבוע

source: Commits by month
ar: إيداعات حسب الشهر
eo: Enmetoj laŭ monato
fi: Toimitukset kuukauden mukaan
fr: Validations par mois
he: קיבועים לפי חודש

source: Month
ar: شهر
eo: Monato
fi: Kuukausi
fr: Mois
he: חודש

source: Month-year
ar: شهر-سنة
eo: Monato-jaro
fi: Kuukausi-vuosi
fr: Mois et année
he: חודש-שנה

source: Form
ar: نموذج
eo: Formo
fi: Lomake
fr: De
he: טופס

source: Filter branches
ar: رَشّح الفروع
fi: Suodata haaroja
he: סינון ענפים

source: Branch:
ar: الفرع:
eo: Branĉo:
fi: Haara:
fr: Branche :
he: ענף:

source: Note:
ar: ملاحظة:
eo: Noto:
fi: Huomautus:
fr: Remarque :
he: הערה:

source: Remote:
ar: البعيد:
eo: Fora:
fi: Etä:
fr: Distant :
he: מרוחק:

source: Tag:
ar: وسم:
eo: Etikedo:
fi: Luokitus:
fr: Étiquette :
he: תגית:

source: Ref:
ar: مرجع:
fi: Viite:
fr: Référence :
he: הפניה:

source: Refs:
ar: المراجع:
eo: Ref-oj:
fi: Viitteet:
he: הפניות:

source: Parent:
ar: أصل:
eo: Gepatro:
fi: Emo:
he: הורה:

source: Child:
ar: ابن:
eo: Infano:
fi: Perillinen:
he: צאצא:

source: Commit is not selected
ar: لم تختار إيداعًا
eo: Enmeto ne estas elektita
fi: Toimitusta ei ole valittu
fr: La validation n'est pas sélectionnée
he: הקיבוע לא נבחר

source: Render commit message in Markdown
ar: صيّر رسالة الإيداع بلغة ماركداون
he: עיבוד הודעות קיבוע ב־Markdown

source: Author:
ar: المؤلف:
eo: Aŭtoro:
fi: Tekijä:
fr: Auteur :
he: יוצר/ת:

source: Committer:
ar: المودع:
eo: Enmetulo:
fi: Toimittaja:
fr: Validateur :
he: מקבע/ת:

source: Type to filter
ar: اكتب للترشيح
eo: Tajpu por filtri
fi: Suodata kirjoittamalla
fr: Taper pour filtrer
he: נא להקליד כדי לסנן

source: Reference
ar: مرجع
eo: Referenco
fi: Viite
he: סימוכין

source: A
ar: أ
he: א׳

source: B
ar: ب
he: ב׳

source: Report
ar: تقرير
eo: Raporto
fi: Raportti
fr: Signaler
he: דיווח

source: View hidden chars…
ar: اعرض المحارف المخفية...
eo: Rigardi kaŝitajn signojn…
fi: Näytä piilomerkit…
he: הצגת תווים נסתרים…

source: Same size blocks
ar: كتل نفس الحجم
eo: Samgrandaj blokoj
fi: Saman kokoiset lohkot
fr: Blocs de même taille
he: מקטעים באותו גודל

source: Show files names
ar: أظهر أسماء الملفات
eo: Montri dosierajn nomojn
fi: Näytä tiedostonimet
fr: Afficher les noms de fichiers
he: הצגת שמות קבצים

source: Show Tree
ar: أظهر الشجرة
eo: Montri Arbon
fi: Näytä puu
fr: Afficher l'arborescence
he: הצגת עץ

# @title:window
source: Kommit Diff[*]
ar: كومت فروق[*]
eo: Kommit Diferenco[*]
he: הבדל עם Kommit[*]

# @title:window
source: Tree
ar: شجرة
eo: Arbo
fi: Puu
fr: Arborescence
he: עץ

source: Unchanged
ar: لم يتغير
eo: Neŝanĝita
fi: Ei muutettu
fr: Non-modifiés
he: ללא שינוי

source: Keep mine
ar: ابقِ خاصتي
eo: Konservi la mian
fi: Pidä minun
fr: Conserver ma version
he: להשאיר את שלי

source: Keep their
ar: ابقِ خاصتهم
eo: Konservi ilian
fi: Pidä heidän
fr: Conserver leur version
he: להשאיר את שלהם

source: Keep mine before their
ar: ابقِ خاصتي قبل خاصتهم
eo: Konservi la mian antaŭ ilia
fi: Pidä minun ennen kuin heidän
fr: Conserver ma version avant la leur
he: להשאיר את שלי לפני שלהם

source: Keep their before mine
ar: ابقِ خاصتهم قبل خاصتي
eo: Konservi ilian antaŭ la mian
fi: Pidä heidän ennen kuin minun
fr: Conserver leur version avant la mienne
he: להשאיר את שלהם לפני שלי

source: Keep my file
ar: ابقِ ملفي
eo: Konservi mian dosieron
fi: Pidä minun tiedostoni
fr: Conserver mon fichier
he: להשאיר את הקובץ שלי

source: Keep their file
ar: ابقِ ملفهم
eo: Konservi ilian dosieron
fi: Pidä heidän tiedostonsa
fr: Conserver leur fichier
he: להשאיר את הקובץ שלהם

source: Previous diff
ar: فروق سابقة
eo: Antaŭa diferenco
fi: Edellinen diff
fr: Différence précédente
he: ההבדל הקודם

source: Next diff
ar: فروق تالية
eo: Sekva diferenco
fi: Seuraava diff
fr: Différence suivante
he: ההבדל הבא

source: Unable to open the file %1
ar: عجز عن فتح الملف %1
eo: Ne eblas malfermi la dosieron %1
fi: Tiedostoa %1 ei voi avata
he: לא ניתן לפתוח את הקובץ %1

source: Save result
ar: احفظ النتيجة
fi: Tallenna tulos
he: שמירת תוצאה

source: Conflicts: <span style='font-weight:bold; color:red;'>%1</span>
ar: تعارضات: <span style='font-weight:bold; color:red;'>%1</span>
fi: Ristiriidat: <span style='font-weight:bold; color:red;'>%1</span>
he: סתירות: <span style='font-weight:bold; color:red;'>%1</span>

source: <span style='color:green;'>All conflicts resolved</span>
ar: <span style='color:green;'>حُلّت جميع التعارضات</span>
fi: <span style='color:green;'>Kaikki ristiriidat ratkaistu</span>
he: <span style='color:green;'>כל הסתירות נפתרו</span>

source: Change icons to symbolic to response the theme changes
he: החלפת הסמלים בייצוג סמלי בהמשך לשינויי ערכות העיצוב

source: Fix crash on diff page
he: תוקנה קריסה בעמוד ההבדלים

source: Fix missing icons
he: תוקנו סמלים חסרים

source: Fix file viewer API
he: תוקן ה־API של מציג הקבצים

source: Can't show the binary file!
he: לא יכול להציג את הקובץ הבינרי!

source: Hide unchanged
he: הסתרת אלו שלא השתנו

source: <html><head/><body><p>Change cr/lf or not</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-coreautocrlf"><span style=" text-decoration: underline; color:#007af4;">More informations...</span></a></p></body></html>
eo: <html><head/><body><p>Ŝanĝi cr/lf aŭ ne</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-coreautocrlf"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj...</span></a></p></body ></html>
fr: <html><head/><body><p>Modifier les retours ligne « CR /LF » ou non</p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-coreautocrlf"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations…</span></a></p></body></html>

source: <html><head/><body><p>Tells Git if the executable bit of files in the working tree is to be honored. </p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-corefileMode"><span style=" text-decoration: underline; color:#007af4;">More informations...</span></a></p></body></html>
eo: <html><head/><body><p>Instruas al Git ĉu la plenumebla bito de dosieroj en la laborarbo estas honorinda. </p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-corefileMode"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj...</span></a></p></body></html>
fr: <html><head/><body><p>Indique à Git si le bit d'exécution des fichiers dans l'arborescence de travail doit être respecté. </p><p><a href="https://git-scm.com/docs/git-config#Documentation/git-config.txt-corefileMode"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations…</span></a></p></body></html>

source: Uncommited
eo: Neengaĝita
fr: Non-validé

source: Hide unchangeds
eo: Kaŝi neŝanĝitajn
fr: Masquer les non-modifiés

# @action
source: Init...
fr: Initialiser…

# @action
source: Open...
fr: Ouvrir…

# @action
source: Clone...
fr: Cloner…

# @action
source: Changed files...
fr: Fichiers modifiés…

# @action
source: Cleanup...
fr: Nettoyer…

# @action
source: Pull...
fr: Tirer…

# @action
source: Fetch...
fr: Rechercher…

# @action
source: Push...
fr: Pousser…

# @action
source: Merge...
fr: Fusionner…

# @action
source: Diff branches...
fr: Comparer les branches…

# @action
source: Search...
fr: Rechercher…

# @action
source: Repo settings...
fr: Configuration des dépôts…

# @action
source: Switch/Checkout...
fr: Basculer / Extraire

# @action
source: Diff tree
fr: Arborescence des différences

source: Remove from index
fr: Supprimer de la table d'index

# @action
source: Create...
fr: Créer…

# @action
source: Browse...
fr: Parcourir…

# @action
source: Remove...
fr: Supprimer…

# @action
source: Note...
fr: Remarque...

source: Create new branch
fr: Créer une nouvelle branche

# @action
source: Diff...
fr: Différence…

# @action
source: Revert...
fr: Rétablir…

# @action
source: Open with...
fr: Ouvrir avec…

# @action
source: Save as...
fr: Enregistrer sous…

# @action
source: Blame
fr: Rejeter

# @action
source: New...
fr: Nouveau…

# @action
source: Rename...
fr: Renommer…

# @action
source: Change url...
fr: Modifier l'URL…

source: Change url
fr: Changer l'URL

source: Rename
fr: Renommer

# @action
source: New stash...
fr: Nouvelle remise…

# @action
source: Pop...
fr: Mettre en pile...

# @action
source: Apply...
fr: Appliquer…

source: Stash
fr: Remiser

source: Create new stash
fr: Créer une nouvelle remise

# @action
source: Add...
fr: Ajouter…

# @action
source: Update...
fr: Mettre à jour…

# @action
source: Sync...
fr: Synchroniser…

source: Are you sure to remove the selected submodule?
fr: Êtes-vous certain de supprimer le sous-module sélectionné ?

source: Remove Submodule
fr: Supprimer un sous-module

source: Unable to remove the module directory
fr: Impossible de supprimer le dossier du module

source: The submodule %1 removed
fr: Sous-module %1 supprimé

# @action
source: New tag...
fr: Nouvelle étiquette…

# @action
source: Checkout...
fr: Extraire...

source: Commit/Push submodule: %1
fr: Intégrer / valider un sous-module : %1

source: Regular view
fr: Vue standard

source: Differential view
fr: Vue différentielle

source: Please wait while the preview is being closed...
fr: Veuillez patienter pendant la fermeture de l'aperçu...

source: Select Branches
fr: Sélectionnez des branches

source: View hidden chars...
fr: Afficher les caractères cachés…

source: Conflicts: %1
fr: Conflits : %1

source: Blocks
fr: Blocs

source: Files
fr: Fichiers

source: Unable to open the file
fr: Impossible d'ouvrir le fichier
