Repository: KDE/kommit
Catalog: po/*/kommit.po
Languages: ar, eo, fi, fr, he

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
fi: Tommi Nieminen
fr: Thomas Vergnaud, Xavier Besnard, Valentin Poupon, Xavier Besnard
he: צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
fi: translator@legisign.org
fr: thomas.vergnaud@mailo.eu, xavier.besnard@kde.org, valentin.poupon@gmail.com, xavier.besnard@kde.org
he: kde-l10n-he@kde.org

source: Clone
ar: استنسخ
eo: Kloni
fi: Monista
fr: Cloner
he: שכפול

source: Init
ar: هيّئ
eo: Iniciati (init)
fi: Alusta
fr: Initialiser
he: אתחול

source: Open
ar: افتح
eo: Malfermi
fi: Avaa
fr: Ouvrir
he: פתיחה

source: Pull
ar: اسحب
eo: Tiri (pull)
fi: Tuo
fr: Tirer
he: משיכה

source: Fetch
ar: احضر
eo: Preni (fetch)
fi: Nouda
fr: Rechercher
he: אחזור

source: Push
ar: ادفع
eo: Puŝi
fi: Vie
fr: Pousser
he: דחיפה

source: Merge
ar: ادمج
eo: Kunfandi (merge)
fi: Yhdistä
fr: Fusionner
he: מיזוג

source: Switch/Checkout
ar: حوّل/انتقل
eo: Ŝalti/Elpreni (switch/checkout)
fi: Siirry/vaihda
fr: Basculer / Extraire
he: החלפה/שליפה

source: Modifications
ar: التعديلات
eo: Modifoj
fi: Muutokset
he: שינויים

source: Diff
ar: فرق
eo: Dif
fr: Différences
he: הבדלים

source: Ignore file
ar: تجاهل ملف
eo: Ignori dosieron
fi: Sivuuta tiedosto
fr: Ignorer le fichier
he: התעלמות מקובץ

source: History
ar: السجل
eo: Historio
fi: Historia
fr: Historique
he: היסטוריה

source: Blame
ar: لوم
eo: Kulpigi (blame)
fi: Moiti
fr: Blâmer
he: אשמה

source: Add
ar: أضف
eo: Aldoni
fi: Lisää
fr: Ajouter
he: הוספה

source: Remove
ar: أزل
eo: Forigi
fi: Poista
fr: Supprimer
he: הסרה

source: Create tag
ar: أنشئ وسمًا
eo: Krei etikedon
fi: Luo luokitus
fr: Créer une étiquette
he: יצירת תגית

source: Cleanup
ar: نظّف
eo: Purigi
fi: Siivoa
fr: Nettoyer
he: ניקוי

source: Diff branches
ar: فرق الفروع
eo: Dif-i branĉojn
fi: Vertaa haaroja
fr: Calculer la différence entre branches
he: הבדל בין ענפים

source: Kommit
ar: كومت

source: Push/Commit to %1
ar: ادفع/أودع في %1
eo: Puŝi/Enmeti al %1
fi: Vie/toimita kohteeseen %1
fr: Intégrer / valider vers %1
he: דחיפה/קיבוע אל %1

source: Push/Commit to submodule %1
ar: ادفع/أودع في الوحدة الفرعية %1
eo: Puŝi/Enmeti al submodulo %1
fi: Vie/toimita alimoduuliin %1
fr: Intégrer / valider vers le sous-module %1
he: דחיפה/קיבוע לתת־מודול %1

source: Git client gui for KDE
ar: عميل غيت رسومي لكدي
eo: Git-kliento por KDE
fi: KDE:n Git-asiakaskäyttöliittymä
fr: Client Git pour KDE
he: לקוח Git חזותי ל־KDE

source: Copyright 2021-2024, Hamed Masafi <hamed.masafi@gmail.com>
ar: حقوق النشر 2021-2024، حامد مصافي <hamed.masafi@gmail.com>
eo: Kopirajto 2021-2024, Hamed Masafi <hamed.masafi@gmail.com>
fi: Tekijänoikeudet 2021–2024, Hamed Masafi <hamed.masafi@gmail.com>
he: כל הזכויות שמורות 2021‏-2024, חאמד מסאפי <hamed.masafi@gmail.com>

source: Author
ar: المؤلف
eo: Aŭtoro
fi: Tekijä
fr: Auteur
he: יוצר

# @info:credit
source: Hamed Masafi
ar: حامد مصافي
he: חאמד מסאפי

# @info:credit
source: Laurent Montel
ar: لورينت مونتيل
he: לורנט מונטל

source: Bug fixing
ar: إصلاح علل
eo: Cimkorektado
fi: Virheiden korjaus
fr: Correction de bugs
he: תיקון תקלות

source: No repo selected
ar: لا يوجد مستودع مختار
eo: Neniu deponejo elektita
fi: Lähdettä ei ole valittu
fr: Aucun dépôt sélectionné
he: לא נבחר מאגר

source: Current branch: %1
ar: الفرع الحالي: %1
eo: Aktuala branĉo: %1
fi: Nykyinen haara: %1
fr: Branche courante : %1
he: ענף נוכחי: %1

source: (merging)
ar: (دمج)
eo: (kunfandante)
fi: (yhdistetään)
fr: (fusion)
he: (מיזוג)

source: (rebasing)
ar: (إعادة أساس)
eo: (rebazigante)
fi: (pohjataan uudelleen)
fr: (re-localisation)
he: (ביסוס מחדש)

# @action
source: Init…
ar: هيّئ…
eo: Iniciati…
fi: Alusta…
he: אתחול…

# @action
source: Open…
ar: افتح…
eo: Malfermi…
fi: Avaa…
he: פתיחה…

# @action
source: Clone…
ar: استنسخ…
eo: Kloni…
fi: Monista…
he: שכפול…

# @action
source: Changed files…
ar: ملفات مغيّرة…
eo: Ŝanĝitaj dosieroj…
fi: Muuttuneet tiedostot…
he: קבצים שהשתנו…

# @action
source: Recent repos
ar: المستودعات الحديثة
eo: Lasttempaj deponejoj
fi: Viimeaikaiset tietovarastot
fr: Dépôts récents
he: מאגרים אחרונים

# @action
source: Cleanup…
ar: نظّف…
eo: Purigi…
fi: Siivoa…
he: ניקוי…

# @action
source: Pull…
ar: اسحب…
eo: Tiri (pull)…
fi: Tuo…
he: משיכה…

# @action
source: Fetch…
ar: احضر…
eo: Preni (fetch)…
fi: Nouda…
he: אחזור…

# @action
source: Push…
ar: ادفع…
eo: Puŝi…
fi: Vie…
he: דחיפה…

# @action
source: Merge…
ar: ادمج…
eo: Kunfandi (merge)…
fi: Yhdistä…
he: מיזוג…

# @action
source: Diff branches…
ar: فرق الفروع…
eo: Dif-i branĉojn…
fi: Vertaa haaroja…
he: הבדל בין ענפים…

# @action
source: Search…
ar: ابحث…
eo: Serĉi…
fi: Etsi…
he: חיפוש…

# @action
source: Repo settings…
ar: إعدادات المستودع…
eo: Deponej-agordoj…
fi: Tietovarastoasetukset…
he: הגדרות מאגר…

# @action
source: Switch/Checkout…
ar: حوّل/انتقل…
eo: Ŝanĝi/Elpreni (switch/checkout)…
he: החלפה/שליפה…

# @action
source: Diff tree…
ar: فرق الشجرة…
eo: Dif-i arbon…
fi: Vertaa puuta…
he: עץ הבדלים…

# @action
source: Change logs…
ar: سجلات التغيير…
eo: Ŝanĝi protokolojn…
fi: Muuta lokeja…
he: יומני שינויים…

source: Clear
ar: امسح
eo: Purigi
fi: Tyhjennä
he: פינוי

source: Unable to create path: %1
ar: غير قادر على إنشاء المسار: %1
eo: Ne eblas krei vojon: %1
fi: Polkua ei voi luoda: %1
fr: Impossible de créer l'emplacement : %1
he: לא ניתן ליצור נתיב: %1

source: Init repo
ar: هيئ المستودع
eo: Iniciati deponejon
fi: Alusta lähde
fr: Initialiser le dépôt
he: אתחול מאגר

source: Open repository
ar: افتح المستودع
eo: Malfermi deponejon
fi: Avaa lähde
fr: Ouvrir un dépôt
he: פתיחת מאגר

source: Cannot switch branch while merging
ar: لا تستطع تحويل الفرع أثناء الدمج
eo: Ne povas ŝanĝi branĉon dum kunfandado
fi: Yhdistettäessä haarasta toiseen ei voi siirtyä
fr: Impossible de changer de branche pendant une fusion
he: לא ניתן לעבור ענף תוך כדי מיזוג

source: Switch branch
ar: حوّل الفرع
eo: Ŝanĝi branĉon
fi: Siirry haaraan
fr: Changer de branche
he: החלפת ענף

source: Version
ar: الإصدار
eo: Versio
fi: Versio
he: גרסה

source: Improve graph painting
ar: حسّن رسم الرسم البياني
eo: Plibonigi pentradon de grafeoj
fi: Parannettu kaavion piirtoa
he: ציור התרשימים השתפר

source: Improve on kommit lib (remove extra dependencies like kf)
ar: حسّن مكتبة كومت (أزل التبعيات الإضافية مثل kf)
eo: Plibonigi kommit-bibliotekon (forigi ekstrajn dependecojn kiel kf)
fi: Parannettu kommit-kirjastoa (poistettu lisäriippuvuudet kuten kf)
he: שיפור בספרייה של kommit (הוסרו תלויות נוספות כגון kf)

source: Add changes logs dialog
ar: أضف حوار سجلات التغييرات
eo: Aldoni dialogon pri ŝanĝprotokoloj
fi: Lisätty muutosloki-ikkuna
he: הוספת חלונית יומן שינויים

source: Fix many small bugs
ar: أصلح العديد من العلل الصغيرة
eo: Ripari multajn cimetojn
fi: Korjattu monia pieniä vikoja
he: תוקנו מגוון תקלות קטנות

source: Fix bug in branch selection in commits widget
ar: أصلح علة في اختيار الفرع في ودجة الإيداعات
fi: Korjattu vika toimitussovelman haaravalinnassa
he: תוקנה תקלה בבחירת ענף בווידג׳ט הקיבועים

source: Improve merge algorithm and text rendering
ar: حسّن خوارزمية الدمج وعرض النص
fi: Parannettu yhdistämisalgoritmeja ja tekstinhahmonnusta
he: אלגוריתם המיזוג ותיצוג הטקסט השתפרו

source: Improve diff window text rendering
ar: حسّن عرض النص في نافذة الفرق
fi: Parannettu eroavuusikkunan tekstinhahmonnusta
he: תיצוג הטקסט בחלון ההבדלים השתפר

source: Fix dolphin menu
ar: أصلح قائمة دولفين
fi: Korjattu Dolphin-valikko
he: תפריט Dolphin תוקן

source: Change logs
ar: سجلات التغيير
eo: Ŝanĝi protokolojn
fi: Muuta lokeja
he: יומני שינויים

source: The path is not git repo: %1
ar: المسار ليس مستودع غيت: %1
eo: La vojo ne estas git-repo: %1
fi: Sijainti ei ole git-lähde: %1
fr: L'emplacement n'est pas un dépôt « git » : %1
he: הנתיב אינו מאגר git:‏ %1

source: The repo inited successfully
ar: المستودع مهيّأ بنجاح
eo: La deponejo sukcese initiciatiĝis
fi: Lähteen alustaminen onnistui
fr: Dépôt initialisé avec succès
he: המאגר אותחל בהצלחה

source: Cannot find the file
ar: لا تستطع إيجاد الملف
eo: Ne eblas trovi la dosieron
fi: Tiedostoa ei löydy
he: לא ניתן למצוא את הקובץ

source: File(s) added to git successfully
ar: الملف(ات) أضيفت إلى غيت بنجاح
eo: Dosiero(j) aldonita(j) al git sukcese
fi: Tiedostojen lisäys gitiin onnistui
fr: Fichier(s) ajouté(s) à git avec succès
he: הקבצים נוספו ל־git בהצלחה

source: Would you like to leave file(s) on disk?
ar: أتود ترك الملف(ات) على القرص؟
eo: Ĉu vi ŝatus lasi dosiero(j)n sur disko?
fi: Haluaisitko jättää tiedostot levylle?
fr: Voulez-vous laisser le(s) fichier(s) sur le disque ?
he: להשאיר את הקבצים בכונן?

# @title:window
source: Remove from index
ar: أزل من الفهرس
eo: Forigi el indekso
fi: Poista indeksistä
he: הסרה מהמפתח

source: File(s) removed from git successfully
ar: الملف(ات) أزيلت من غيت بنجاح
eo: Dosiero(j) forigita(j) de git sukcese
fi: Tiedostojen poisto gitistä onnistui
fr: Fichier(s) supprimé(s) de git avec succès
he: הקבצים הוסרו מ־git בהצלחה

source: Status:
ar: الحالة:
eo: Statuso:
fi: Tila:
fr: État :
he: מצב:

source: Removed
ar: أزيل
eo: Forigita
fi: Poistettu
fr: Supprimés
he: הוסר

source: Choose file version
ar: اختر إصدار الملف
fi: Valitse tiedoston versio
he: בחירת גרסה קובץ

source: Base file
ar: ملف الأساس
fi: Pohjatiedosto
he: קובץ בסיס

source: Local file
ar: ملف محلي
fi: Paikallinen tiedosto
he: קובץ מקומי

source: Remote file
ar: ملف بعيد
fi: Etätiedosto
he: קובץ מרוחק

source: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">Diff base with local </span></a></p></body></html>
ar: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">فرق الأساس مع المحلي </span></a></p></body></html>
fi: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">Näytä erot perustasta paikalliseen kohteeseen </span></a></p></body></html>
he: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">תיעוד הבדלים בין הבסיס למקומי </span></a></p></body></html>

source: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">Diff base with remote </span></a></p></body></html>
ar: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">فرق الأساس مع البعيد </span></a></p></body></html>
fi: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">Näytä erot perustasta etäkohteeseen </span></a></p></body></html>
he: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">תיעוד הבדלים בין הבסיס למרוחק span></a></p></body></html>

source: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">Diff local with remote</span></a></p></body></html>
ar: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">فرق المحلي مع البعيد</span></a></p></body></html>
fi: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">Näytä erot paikallisesta etäkohteeseen</span></a></p></body></html>
he: <html><head/><body><p><a href="#"><span style=" text-decoration: underline; color:#007af4;">תיעוד הבדלים בין המקומי למרוחק</span></a></p></body></html>

source: All conflicts resolved
ar: جميع التعارضات محلولة
fi: Kaikki ristiriidat ratkaistu
he: כל הסתירות נפתרו

source: %1 conflict remained
ar: بقي تعارض واحد
fi: %1 ristiriita jäljellä
he: נשארה סתירה

source: Conflicts
ar: التعارضات
fi: Ristiriidat
he: סתירות

source: Conflicts count
ar: عدد التعارضات
fi: Ristiriitamäärä
he: כמות סתירות

source: Main Toolbar
ar: شريط الأدوات الرئيسي
eo: Ĉefa Ilobreto
fi: Päätyökalurivi
fr: Barre principale d'outils
he: סרגל כלים ראשי

source: Repo
ar: المستودع
fi: Lähde
fr: Dépôt
he: מאגר

source: Close
ar: أغلق
eo: Fermi
fi: Sulje
fr: Fermer
he: סגירה

source: The changes to file are not saved to the disk. What you want to do?
ar: التغييرات على الملف غير محفوظة على القرص. ماذا تود أن تفعل؟
eo: La ŝanĝoj al dosiero ne estas konservitaj al la disko. Kion vi volas fari?
fi: Tiedoston muutoksia ei ole tallennettu. Mitä haluat tehdä?
fr: Les modifications apportées au fichier ne sont pas enregistrées sur le disque. Voulez-vous le faire ?
he: השינויים לקובץ לא נשמרו לכונן. מה לעשות?

source: Mark as resolved
ar: علّم كمحلول
eo: Marki kiel solvita
fi: Merkitse ratkaistuksi
fr: Marquer comme résolu
he: לסמן כפתור

source: Leave as is
ar: اترك كما هو
eo: Lasi kiel estas
fi: Jätä sikseen
fr: Laisser tel quel
he: להשאיר כמו שזה

source: Don't exit
ar: لا تخرج
eo: Ne eliri
fi: Älä lopeta
fr: Ne pas sortir
he: לא לצאת

source: Overview
ar: نظرة عامة
eo: Superrigardo
fi: Yleiskuva
fr: Vue d'ensemble
he: סקירה

source: Branches
ar: الفروع
eo: Branĉoj
fi: Haarat
he: ענפים

source: Branches type:
ar: نوع الفروع:
fi: Haaran tyyppi:
he: סוג ענפים:

source: All
ar: الكل
eo: Ĉiuj
fi: Kaikki
fr: Tous
he: הכול

source: Local
ar: محلي
fi: Paikallinen
he: מקומי

source: Remote
ar: بعيد
fi: Etäkohde
fr: Distant
he: מרוחק

source: Reference branch:
ar: الفرع المرجعي:
eo: Referenca branĉo:
fi: Viitehaara:
fr: Branche de référence :
he: ענף סימוכין:

source: New
ar: جديد
eo: Nova
fi: Uusi
fr: Nouveau
he: חדש

source: Checkout
ar: انتقل
eo: Elpreni (checkout)
fi: Vaihda
fr: Extraire
he: שליפה

source: Browse
ar: تصفّح
eo: Foliumi
fi: Selaa
fr: Parcourir
he: עיון

source: Commits
ar: الإيداعات
eo: Enmetoj (commits)
fi: Toimitukset
fr: Validations
he: קיבועים

source: Filter...
ar: رشّح...
eo: Filtri...
fi: Suodata…
fr: Filtrer…
he: סינון…

source: Update
ar: حدّث
eo: Ĝisdatigi
fi: Päivitä
fr: Mettre à jour
he: עדכון

source: Remotes
ar: الأطراف البعيدة
eo: Remotoj
fi: Etäkohteet
fr: Distantes
he: מרוחקים

source: Information
ar: معلومات
eo: Informoj
fi: Tietoa
fr: Informations
he: פרטים

source: Default branch:
ar: الفرع المبدئي:
eo: Defaŭlta branĉo:
fi: Oletushaara:
fr: Branche par défaut :
he: ענף ברירת מחדל:

source: Fetch url:
ar: مسار جلب:
eo: Preni URL:
fi: Nouto-osoite:
fr: Extraire à partir de l'URL :
he: כתובת משיכה:

source: Push url:
ar: مسار دفع:
eo: Puŝ-url:
fi: Vientiosoite:
fr: Pousser à l'URL :
he: כתובת דחיפה:

source: Name:
ar: الاسم:
eo: Nomo:
fi: Nimi:
fr: Nom :
he: שם:

source: Branches:
ar: الفروع:
eo: Branĉoj:
fi: Haarat:
he: ענפים:

source: Name
ar: الاسم
eo: Nomo
fi: Nimi
fr: Nom
he: שם

source: Ref name
ar: اسم المرجع
eo: Ref-nomo
fi: Viitenimi
fr: Nom de référence
he: שם הפניה

source: Upstream
ar: المنبع
eo: Kontraŭflue (upstream)
fi: Ylävirta
fr: En amont
he: מקור

source: Status
ar: الحالة
eo: Statuso
fi: Tila
fr: État
he: מצב

source: Reports
ar: التقارير
eo: Raportoj
fi: Raportit
fr: Rapports
he: דוחות

source: Table view
ar: عرض الجدول
eo: Tabela vido
fi: Taulukkonäkymä
fr: Vue en tableau
he: תצוגת טבלה

source: Table
ar: جدول
eo: Tabelo
fi: Taulukko
he: טבלה

source: Chart view
ar: عرض الرسم البياني
eo: Diagrama vido
fi: Kaavionäkymä
fr: Vue en diagramme
he: תצוגת תרשים

source: Chart
ar: رسم بياني
eo: Diagramo
fi: Kaavio
fr: Diagramme
he: תרשים

source: Refresh data
ar: حدّث البيانات
eo: Refreŝigi datumojn
fi: Virkistä tiedot
fr: Rafraîchir les données
he: ריענון נתונים

source: Refresh
ar: حدّث
eo: Refreŝigi
fi: Virkistä
fr: Rafraîchir
he: ריענון

source: Stashes
ar: المخبوءات
eo: Kaŝkonservoj (stashes)
fi: Jemmat
fr: Remises
he: הטמנות

source: <html><head/><body><p>Save your local modifications to a new stash entry and roll them back to HEAD (in the working tree and in the index). The part is optional and gives the description along with the stashed state.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-push-p--patch-k--no-keep-index-u--include-untracked-a--all-q--quiet-m--messageltmessagegt--pathspec-from-fileltfilegt--pathspec-file-nul--ltpathspecgt82308203"><span style=" text-decoration: underline; color:#2980b9;">More information...</span></a></p></body></html>
ar: <html><head/><body><p>احفظ تعديلاتك المحلية إلى مدخل مخبأة جديد وأرجعها إلى HEAD (في شجرة العمل وفي الفهرس). الجزء اختياري ويقدم الوصف مع حالة المخبوءة.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-push-p--patch-k--no-keep-index-u--include-untracked-a--all-q--quiet-m--messageltmessagegt--pathspec-from-fileltfilegt--pathspec-file-nul--ltpathspecgt82308203"><span style=" text-decoration: underline; color:#2980b9;">مزيد من المعلومات...</span></a></p></body></html>
eo: <html><head/><body><p>Konservi viajn lokajn modifojn al nova kaŝkonserva enskribo kaj ruli ilin reen al HEAD (en la laborarbo kaj en la indekso). La parto estas laŭvola kaj donas la priskribon kune kun la kaŝita stato.</p><p><br/></p><p><a href="https://git-scm.com/docs/ git-stash#Documentation/git-stash.txt-push-p--patch-k--no-keep-index-u--include-untracked-a--all-q--quiet-m--messageltmessagegt--pathspec-from-fileltfilegt--pathspec-file-nul--ltpathspecgt82308203"><span style=" text-decoration: underline; color:#2980b9;">Pliaj informoj...</span></a></p></body></html>
fr: <html><head/><body><p>Enregistre vos modifications locales vers une nouvelle remise et rétablit l'état de « HEAD » (dans l'arborescence de travail et l'index). Cette partie est optionnelle et donne la description qui accompagne l'état de la remise.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-push-p--patch-k--no-keep-index-u--include-untracked-a--all-q--quiet-m--messageltmessagegt--pathspec-from-fileltfilegt--pathspec-file-nul--ltpathspecgt82308203"><span style=" text-decoration: underline; color:#2980b9;">Plus d'informations…</span></a></p></body></html>
he: <html><head/><body><p>לשמור את השינויים המקומיים שלך לרשומת הטמנה חדשה ולהסיג אותם בחזרה לראש/HEAD (בעץ העבודה ובמפתח). החלק הוא בגדר רשות ומספק תיאור לצד מצב ההטמנה.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-push-p--patch-k--no-keep-index-u--include-untracked-a--all-q--quiet-m--messageltmessagegt--pathspec-from-fileltfilegt--pathspec-file-nul--ltpathspecgt82308203"><span style=" text-decoration: underline; color:#2980b9;">פרטים נוספים…</span></a></p></body></html>

source: Create new
ar: أنشئ جديدًا
eo: Krei novan
fi: Luo uusi
fr: Créer nouveau
he: יצירת חדשה

source: Remove selected
ar: أزل المختار
eo: Forigi elektitan
fi: Poista valittu
fr: Supprimer la sélection
he: הסרת הנבחרת

source: <html><head/><body><p>Apply stash to top of current working directory</p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-apply--index-q--quietltstashgt"><span style=" text-decoration: underline; color:#2980b9;">More information...</span></a></p></body></html>
ar: <html><head/><body><p>طبّق المخبوءة على رأس دليل العمل الحالي</p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-apply--index-q--quietltstashgt"><span style=" text-decoration: underline; color:#2980b9;">مزيد من المعلومات...</span></a></p></body></html>
eo: <html><head/><body><p>Apliki stash al la supro de nuna labordosierujo</p><p><a href="https://git-scm.com/docs/git-stash# Documentation/git-stash.txt-apply--index-q--quietltstashgt"><span style=" text-decoration: underline; color:#2980b9;">Pliaj informoj...</span></a></p></body></html>
fr: <html><head/><body><p>Appliquer la remise au dossier de travail courant</p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-apply--index-q--quietltstashgt"><span style=" text-decoration: underline; color:#2980b9;">Plus d'informations…</span></a></p></body></html>
he: <html><head/><body><p>החלת הטמעה על גבי תיקיית העבודה הנוכחית</p><p><a href="https://git-scm.com/docs/git-stash#Documentation/git-stash.txt-apply--index-q--quietltstashgt"><span style=" text-decoration: underline; color:#2980b9;">פרטים נוספים…</span></a></p></body></html>

source: Apply selected
ar: طبّق المختار
eo: Apliki elektitan
fi: Käytä valittua
fr: Appliquer la sélection
he: החלת הנבחרת

source: Submodules
ar: الوحدات الفرعية
eo: Submoduloj
fi: Alimoduulit
fr: sous-modules
he: תת־מודולים

source: Add new submodule
ar: أضف وحدة فرعية جديدة
eo: Aldoni novan submodulon
fi: Lisää uusi alimoduuli
fr: Ajouter un nouveau sous-module
he: הוספת תת־מודול חדש

source: Tags
ar: الوسوم
eo: Etikedoj
fi: Tunnisteet
fr: Étiquettes
he: תגיות

source: Checkout to selected
ar: انتقل إلى المختار
eo: Elpreni al elektita
fi: Vaihda valittuun
fr: Extraire la sélection
he: שליפה לנבחר

source: Added color
ar: لون الإضافة
eo: Aldonita koloro
fi: Lisätty väri
fr: Couleur d'ajout
he: נוסף צבע

source: Removed color
ar: لون الإزالة
eo: Forigita koloro
fi: Poistettu väri
fr: Couleur de suppression
he: הוסר צבע

source: Modified color
ar: لون التعديل
eo: Modifita koloro
fi: Muutettu väri
fr: Couleur de modification
he: השתנה צבע

source: color of the foreground
ar: لون المقدمة
eo: koloro de la malfono
fi: edustaväri
fr: Couleur d'avant-plan
he: צבע החזית

source: age of the project
ar: عمر المشروع
eo: aĝo de la projekto
fi: projektin ikä
fr: Âge du projet
he: גיל המיזם

source: Open last repo at startup
ar: افتح آخر مستودع عند بدء التشغيل
eo: Malfermi lastan deponejon je ekfunkciigo
fi: Avaa käynnistettäessä viimeisin lähde
fr: Ouvrir le dernier dépôt au lancement
he: פתיחת המאגר האחרון עם העלייה

source: General
ar: عام
eo: Ĝenerala
fi: Perusasetukset
fr: Général
he: כללי

source: Git
ar: غت

source: Startup
ar: بدء التشغيل
eo: Ekfunkciigo
fi: Käynnistys
fr: Lancement
he: התחלה

source: Default calendar:
ar: التقويم المبدئي:
eo: Defaŭlta kalendaro:
fi: Oletuskalenteri:
fr: Calendrier par défaut :
he: לוח שנה כברירת מחדל:

source: Git binary path:
ar: مسار ثنائي غيت:
eo: Git-binarprograma vojo:
fi: Git-ohjelmatiedoston sijainti:
fr: Emplacement du binaire « Git » :
he: נתיב לבינרי של Git:

source: Added diff color:
ar: لون فرق الإضافة:
eo: Aldonita diferenckoloro:
fi: Lisäyksen vertailuväri:
fr: Couleur d'ajout :
he: צבע הבדל שנוסף:

source: Removed diff color:
ar: لون فرق الإزالة:
eo: Forigita diferenckoloro:
fi: Poiston vertailuväri:
fr: Couleur de suppression :
he: צבע הבדל שהוסר:

source: Modified diff color:
ar: لون فرق التعديل:
eo: Modifita diferenckoloro:
fi: Muutoksen vertailuväri:
fr: Couleur de modification :
he: צבע הבדל שהשתנה:

source: Register kommit diff tool
ar: سجّل أداة فرق كومت
eo: Registri kommit diff-ilon
fi: Rekisteröi kommit-vertailutyökalu
fr: Enregistrer un outil de différences pour Kommit
he: רישום כלי ההבדלים של kommit

source: Register kommit merge tool
ar: سجّل أداة دمج كومت
eo: Registri kommit merge-ilon
fi: Rekisteröi kommit-yhdistämistyökalu
fr: Enregistrer un outil de fusion pour Kommit
he: רישום כלי המיזוג של kommit

source: Git proxy:
ar: وكيل غيت:
eo: Git prokurilo:
fi: Git-välityspalvelin:
fr: Serveur mandataire pour Git :
he: מתווך Git:

source: Already up to date.
ar: محدّث مسبقًا.
eo: Jam ĝisdatigita.
fi: Jo ajan tasalla.
fr: Déjà à jour.
he: כבר עדכני.

source: Error
ar: خطأ
eo: Eraro
fi: Virhe
fr: Erreur
he: שגיאה

source: Your local changes to the following files would be overwritten by checkout. Please commit your changes or stash them before you switch branches.
ar: تغييراتك المحلية على الملفات التالية ستُستبدل بالانتقال. أودع تغييراتك أو اخبئها قبل أن تحوّل الفروع.
eo: Viaj lokaj ŝanĝoj al la sekvaj dosieroj estus anstataŭitaj per kazado. Bonvolu fari viajn ŝanĝojn aŭ konservi ilin antaŭ ol vi ŝanĝi branĉojn.
fi: Vaihdettaessa paikalliset muutokset seuraaviin tiedostoihin korvattaisiin. Toimita muutokset tai siirrä ne jemmaan ennen haaran vaihtoa.
fr: Vos changements locaux aux fichiers suivants seraient écrasés par l'extraction. Veuillez valider vos changement ou les remiser avant de changer de branche.
he: השינויים המקומיים שערכת בקבצים הבאים יידרסו על ידי השליפה. נא לקבע את השינויים שלך או להטמין אותם לפני מעבר בין ענפים.

source: Unknown
ar: مجهول
eo: Nekonata
fi: Tuntematon
fr: Inconnu
he: לא ידוע

source: Up to date
ar: محدّث
eo: Ĝisdata
fi: Ajan tasalla
fr: À jour
he: עדכני
