Repository: KDE/kommit
Catalog: po/*/kommit.po
Languages: ar, eo, fi, fr, he

source: Error %1: %2
ar: الخطأ %1: %2
fi: Virhe %1: %2
he: שגיאה %1: %2

source: Fetch from origin
ar: جلب من الأصل
eo: Preni de origino
fi: Nouda alkulähteestä
fr: Extraire depuis l'origine
he: משיכה מהמקור

source: All branches
ar: جميع الفروع
eo: Ĉiuj branĉoj
fi: Kaikki haarat
fr: Toutes les branches
he: כל הענפים

source: Options
ar: الخيارات
eo: Opcioj
fi: Valinnat
he: אפשרויות

source: Prune
ar: قلّم
eo: Pritondi (prune)
fi: Karsi
fr: Élaguer
he: פינוי

source: Redirect
ar: أعد التوجيه
fi: Edennä
he: הפניה

source: Starting...
ar: يُبدأ...
fi: Aloitetaan…
he: מתחיל…

source: Uncommitted
ar: غير مودَع
fi: Ei toimitettu
he: לא קובע

# @title:window
source: Blame file: %1
ar: ملف اللوم: %1
eo: Kulpa dosiero: %1
fi: Moitetiedosto: %1
fr: Rejeter un fichier : %1
he: קובץ אשמה: %1

source: Dialog
ar: حوار
eo: Dialogo
fi: Ikkuna
fr: Dialogue
he: חלונית

# @title:window
source: File log: %1
ar: سجل الملف: %1
eo: Dosiera protokolo: %1
fi: Tiedostoloki: %1
fr: Journal du fichier : %1

source: View type
ar: نوع العرض
eo: Vidspeco
fi: Katsele tyyppiä
fr: Type d'affichage
he: הצגת סוג

source: &Regular view
ar: عرض &عادي
eo: &Regula vido
fi: Ta&vallinen näkymä
he: תצוגה ר&גילה

source: Differential &view
ar: عرض &تفاضلي
eo: Diferenca &vido
fi: &Eroavuusnäkymä
he: תצוגת ה&בדלים

source: Left
ar: يسار
eo: Maldekstra
fi: Vasen
fr: Gauche
he: שמאל

source: Right
ar: يمين
eo: Dekstra
fi: Oikea
fr: Droite
he: ימין

# @title:window
source: Browse files: %1
ar: تصفح الملفات: %1
eo: Foliumi dosierojn: %1
fi: Selaa tiedostoja: %1
fr: Parcourir les fichiers : %1
he: עיון בקבצים: %1

source: Extract to
ar: استخرج إلى
eo: Eltiri al
fi: Poimi kohteeseen
he: חילוץ אל

source: All file(s) extracted successfully
ar: اُستخرج جميع الملفات بنجاح
eo: Ĉiuj dosiero(j) eltiriĝis sukcese
fi: Kaikkien tiedostojen poiminta onnistui
he: כל הקבצים חולצו בהצלחה

source: An error occurred while extracting file(s)
ar: وقع خطأ أثناء استخراج الملفات
eo: Eraro okazis eltirante dosiero(j)n
fi: Poimittaessa tiedostoja tapahtui virhe
he: שגיאה בחילוץ הקבצים

source: Extract
ar: استخرج
eo: Eltiri
fi: Poimi
he: חילוץ

source: Branch:
ar: الفرع:
eo: Branĉo:
fi: Haara:
fr: Branche :
he: ענף:

# @title:window
source: Closing preview
ar: يُغلَق المعاينة
eo: Fermante antaŭrigardon
fr: Fermeture de l'aperçu

source: Please wait while the preview is being closed…
ar: تفضّل بالانتظار ريثما تُغلَق المعاينة...
eo: Bonvolu atendi dum la antaŭvido estas fermiĝanta…

# @title:window
source: View file: %1
ar: اعرض الملف: %1
eo: Vidi dosieron: %1
fi: Näytä tiedosto: %1
fr: Visualiser le fichier : %1
he: הצגת קובץ: %1

source: MainWindow
ar: النافذة الرئيسية
eo: Ĉeffenestro
fi: Pääikkuna
fr: Fenêtre principale
he: חלון ראשי

source: The file is ignored already
ar: الملف متجاهَل مسبقًا
eo: La dosiero jam estas ignorita
fi: Tämä tiedosto sivuutetaan jo
fr: Le fichier est déjà ignoré
he: הקובץ כבר בהתעלמות

source: Please enter the pattern
ar: تفضّل بإدخال النمط
eo: Bonvolu enigi la ŝablonon
fi: Kirjoita kuvio
fr: Veuillez saisir le motif
he: נא למלא את התבנית

source: Unable to open file: %1
ar: تعذّر فتح الملف: %1
eo: Ne eblas malfermi dosieron: %1
fi: Tiedostoa ei voi avata: %1
fr: Impossible d'ouvrir le fichier : %1
he: לא ניתן לפתוח את הקובץ: %1

source: Pattern:
ar: النمط:
eo: Ŝablono:
fi: Kuvio:
fr: Motif :
he: תבנית:

source: Name and extension
ar: الاسم والامتداد
eo: Nomo kaj finaĵo
fi: Nimi ja pääte
fr: Nom et extension
he: שם וסיומת

source: All files by this extension
ar: جميع الملفات بهذا الامتداد
eo: Ĉiuj dosieroj per ĉi tiu finaĵo
fi: Kaikki tämän päätteiset tiedostot
fr: Tous les fichiers avec cette extension
he: כל הקבצים עם הסיומת הזאת

source: All files by this name
ar: جميع الملفات بهذا الاسم
eo: Ĉiuj dosieroj sub ĉi tiu nomo
fi: Kaikki tämän nimiset tiedostot
fr: Tous les fichiers avec ce nom
he: כל הקבצים בשם הזה

source: Path
ar: المسار
eo: Vojo
fi: Sijainti
fr: Emplacement
he: נתיב

source: Exact the path
ar: المسار بالضبط
eo: Ekzakti la vojon
fi: Juuri tässä sijainnissa
fr: Suivre l'emplacement

source: File in everywhere
ar: الملف في كل مكان
eo: File en ĉie
fi: Tiedosto missä tahansa
fr: Fichier n'importe où
he: הקובץ בכל מקום

source: .gitignore in the repository root
ar: .gitignore في جذر المستودع
eo: .gitignore en la deponejo radiko
fi: .gitignore lähteen juuressa
fr: .gitignore dans la racine du dépôt
he: ‎.gitignore בתיקיית העל של המאגר

source: .gitignore in the containing directory
ar: .gitignore في الدليل الحاوي
eo: .gitignore en la enhavanta dosierujo
fi: .gitignore ylemmässä kansiossa
fr: .gitignore dans le dossier contenant
he: ‎.gitignore בתיקייה המכילה

source: Init git repo
ar: هيّئ مستودع جيت
eo: Iniciati git-deponejon
fi: Alusta git-lähde
fr: Initialiser le dépôt git
he: אתחול מאגר git

source: From:
ar: من:
eo: De:
fi: Mistä:
fr: De :
he: מ־:

source: Strategy:
ar: الاستراتيجية:
eo: Strategio:
fi: Strategia:
fr: Stratégie :
he: אסטרטגיה:

source: <html><head/><body><p>The merge mechanism (git merge and git pull commands) allows the backend merge strategies to be chosen with -s option. Some strategies can also take their own options, which can be passed by giving -X&lt;option&gt; arguments to git merge and/or git pull.</p><p><a href="https://git-scm.com/docs/merge-strategies"><span style=" text-decoration: underline; color:#2980b9;">More information</span></a></p></body></html>
ar: <html><head/><body><p>تتيح آلية الدمج (أمر git merge وأمر git pull) اختيار استراتيجيات الدمج الخلفية بخيار -s. يمكن لبعض الاستراتيجيات أن تأخذ خياراتها الخاصة، والتي يمكن تمريرها بإعطاء وسائط -X&lt;option&gt; إلى git merge و/أو git pull.</p><p><a href="https://git-scm.com/docs/merge-strategies"><span style=" text-decoration: underline; color:#2980b9;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>La kunfandimekanismo (git merge kaj git pull-komandoj) permesas la backend kunfandi strategiojn esti elektitaj per opcio -s. Iuj strategioj ankaŭ povas preni siajn proprajn opciojn, kiuj povas esti pasigitaj donante -X&lt;option&gt; argumentojn por git merge kaj/aŭ git pull.</p><p><a href="https://git-scm .com/docs/merge-strategies"><span style=" text-decoration: underline; color:#2980b9;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Le mécanisme de fusion (Commandes « git merge » et « git pull » ) permet de sélectionner les stratégie de fusion du moteur avec l'option « -s ». Certaines stratégies peuvent également avoir leurs propres options, passée en donnant des arguments -X&lt;option&gt; à « git merge » et / ou « git pull ».</p><p><a href="https://git-scm.com/docs/merge-strategies"><span style=" text-decoration: underline; color:#2980b9;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>מנגנון המיזוג (פקודות git merge ו־git pull) מאפשר לבחור אסטרטגיות מיזוג עם האפשרות ‎-s. חלק מהאסטרטגיות מקבלות אפשרויות משלהן, אפשר להעביר אותן דרך ארגומנטים של ‎-X&lt;option&gt; ל־git merge ו/או ל־git pull.</p><p><a href="https://git-scm.com/docs/merge-strategies"><span style=" text-decoration: underline; color:#2980b9;">פרטים נוספים</span></a></p></body></html>

source: To:
ar: إلى:
eo: Al:
fi: Mihin:
fr: À :
he: עד:

source: Fast forward:
ar: تقديم سريع:
eo: Rapide antaŭen:
fi: Pikakelaa:
fr: Avance rapide :
he: הרצה קדימה:

source: <html><head/><body><p>Specifies how a merge is handled when the merged-in history is already a descendant of the current history.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---ff"><span style=" text-decoration: underline; color:#007af4;">More information</span></a></p></body></html>
ar: <html><head/><body><p>يُحدد كيفية التعامل مع الدمج عندما يكون السجل المُدمج هو سليل السجل الحالي مسبقًا.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---ff"><span style=" text-decoration: underline; color:#007af4;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Specifas kiel kunfando estas pritraktata kiam la kunfandita historio jam estas posteulo de la nuna historio.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---ff"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Spécifie comment une fusion est gérée lorsque l'historique de fusion est déjà un descendant de l'historique courant..</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---ff"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>לציין איך מטופל מיזוג כאשר ההיסטוריה שמוזגה פנימה היא כבר צאצאית של ההיסטוריה הנוכחית.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---ff"><span style=" text-decoration: underline; color:#007af4;">מידע נוסף</span></a></p></body></html>

source: Default
ar: مبدئي
eo: Defaŭlta
fi: Oletus
fr: Défaut
he: ברירת מחדל

source: Allow fast forward
ar: اسمح بالتقديم السريع
eo: Permesi rapide antaŭen
fi: Salli pikakelaus
fr: Autoriser l'avance rapide
he: לאפשר הרצה קדימה

source: Fast forward only
ar: تقديم سريع فقط
eo: Rapide antaŭen nur
fi: Vain pikakelaus
fr: Avance rapide uniquement
he: הרצה קדימה בלבד

source: No fast forward
ar: لا تقديم سريع
eo: Neniu rapida antaŭen
fi: Ei pikakelausta
fr: Pas d'avance rapide
he: ללא הרצה קדימה

source: <html><head/><body><p>By default, git merge command refuses to merge histories that do not share a common ancestor. This option can be used to override this safety when merging histories of two projects that started their lives independently. As that is a very rare occasion, no configuration variable to enable this by default exists and will not be added.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---allow-unrelated-histories"><span style=" text-decoration: underline; color:#007af4;">More information</span></a></p></body></html>
ar: <html><head/><body><p>مبدئيًا، يرفض أمر git merge دمج السجلات التي لا تشترك في سلف مشترك. يمكن استعمال هذا الخيار لتجاوز هذا الأمان عند دمج سجلات مشروعين بدأ حياتهما باستقلالية. بما أن هذه مناسبة نادرة جدًا، لا يوجد متغير ضبط موجود لتمكين هذا مبدئيًا ولن يُضاف.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---allow-unrelated-histories"><span style=" text-decoration: underline; color:#007af4;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Defaŭlte, git merge komando rifuzas kunfandi historiojn kiuj ne kunhavas komunan prapatron. Ĉi tiu opcio povas esti uzata por superregi ĉi tiun sekurecon dum kunfandado de historioj de du projektoj, kiuj komencis siajn vivojn sendepende. Ĉar tio estas tre malofta okazo, neniu agorda variablo por ebligi ĉi tion defaŭlte ekzistas kaj ne estos aldonita.</p><p><br/></p><p><a href="https:/ /git-scm.com/docs/git-merge#Documentation/git-merge.txt---allow-unrelated-histories"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Par défaut, la commande de fusion « git merge » refuse de fusionner les historiques qui ne partagent pas un ancêtre commun. Cette option peut être utilisée pour contourner cette sécurité lors de la fusion de deux projets indépendants. Comme il s'agit d'une situation très rare, aucune variable de configuration n'existe pour permettre cela.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---allow-unrelated-histories"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>כברירת מחדל, פקודת git merge מסרבת למזג היסטוריות שלא חולקות הורה משותף. אפשר להשתמש באפשרות הזאת כדי למזג היסטוריות של שני מיזמים שהחלו את חייהם בנפרד זה מזה. כיוון שזה מאורע נדיר יחסית, אף משתנה בהגדרות מפעיל את זה כברירת מחדל וכנראה שגם לא יהיה כזה בעתיד.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---allow-unrelated-histories"><span style=" text-decoration: underline; color:#007af4;">פרטים נוספים</span></a></p></body></html>

source: Allow unrelated histories
ar: اسمح بالسجلات غير ذات الصلة
eo: Permesi nerilatajn historiojn
fr: Autoriser les historiques sans lien
he: לאפשר היסטוריות לא קשורות

source: <html><head/><body><p>Produce the working tree and index state as if a real merge happened (except for the merge information), but do not actually make a commit, move the HEAD, or record $GIT_DIR/MERGE_HEAD (to cause the next git commit command to create a merge commit). This allows you to create a single commit on top of the current branch whose effect is the same as merging another branch (or more in case of an octopus).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---squash"><span style=" text-decoration: underline; color:#007af4;">More information</span></a></p></body></html>
ar: <html><head/><body><p>أنتج شجرة العمل وحالة الفهرس كما لو أن دمجًا حقيقيًا وقع (ما عدا معلومات الدمج)، ولكن لا تنشئ إيداعًا فعليًا، أو تنقل HEAD، أو تسجل $GIT_DIR/MERGE_HEAD (لتسبّب في إنشاء أمر git commit التالي إيداع دمج). يسمح لك هذا بإنشاء إيداع واحد على رأس الفرع الحالي ويكون تأثيره هو نفسه دمج فرع آخر (أو أكثر في حالة الأخطبوط).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---squash"><span style=" text-decoration: underline; color:#007af4;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Produkti la laborkopian arbon kaj indeksan staton kvazaŭ reala kunfandiĝo okazus (krom la kunfando-informoj), sed ne efektive fari enmeton, movi la HEAD aŭ registri $GIT_DIR/MERGE_HEAD (por igi la sekvan komandon git commit krei kunfand-enmeton). Ĉi tio ebligas al vi krei ununuran enmeton super la nuna branĉo, kies efiko estas sama kiel kunfandi alian branĉon (aŭ pli en kazo de polpo).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---squash"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Produit l'arbre de travail et l'état d'index comme si une vraie fusion se produisait (sauf pour les informations de fusion), mais ne réalise pas effectivement une validation, ni ne déplace HEAD, ou enregistre $GIT_DIR/MERGE_HEAD (pour provoquer la prochaine commande de validation pour créer une validation de fusion). Cela vous permet de créer une seule validation sur la branche courante dont l'effet est la même que fusionner une autre branche (ou plus dans le cas d'une pieuvre).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt---squash"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations</span></a></p></body></html>

source: Squash
ar: كبت
eo: Kunigi plurajn enmetojn al unu (Squash)
fi: Litistä
fr: Rejeter
he: מעיכה

source: Ours
ar: خاصتنا
eo: Nia
fi: Meidän
fr: Notre version
he: שלנו

source: Theirs
ar: خاصتهم
eo: Ilia
fi: Heidän
fr: Leur version
he: שלהם

source: <html><head/><body><p>Treats lines with the indicated type of whitespace change as unchanged for the sake of a three-way merge. Whitespace changes mixed with other changes to a line are not ignored. </p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-ignore-space-change"><span style=" text-decoration: underline; color:#007af4;">More information</span></a></p></body></html>
ar: <html><head/><body><p>عامل السطور ذات نوع تغيير المسافة البيضاء المشار إليه كأنها لم تتغير لأجل دمج ثلاثي الأطراف. تغييرات المسافة البيضاء الممزوجة بتغييرات أخرى في السطر لا تتجاهلها.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-ignore-space-change"><span style=" text-decoration: underline; color:#007af4;">مزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Traktas liniojn kun la indikita speco de blankspacŝanĝo kiel senŝanĝe pro tridirekta kunfandiĝo. Blankspacŝanĝoj miksitaj kun aliaj ŝanĝoj al linio ne estas ignorataj. </p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-ignore-space-change"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Traiter les lignes sans le changement d'espace blanc indiqué pour permettre une fusion tri-partite. Les changements d'espaces blancs mélangés avec les autres changements dans les lignes ne sont pas ignorés. </p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-ignore-space-change"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>מתייחס לשורות עם שינויים בסוגים מוגדרים של רווחים. כאילו לא גרמו לשינויים לטובת מיזוג תלת־כיווני. שינויים ברווחים בערבוב עם שינויים אחרים לשורה לא נפסחים.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-ignore-space-change"><span style=" text-decoration: underline; color:#007af4;">פרטים נוספים</span></a></p></body></html>

source: Ignore space change
ar: تجاهل تغيير المسافة
eo: Ignori interspacoŝanĝon
fi: Sivuuta tyhjemerkkien muutokset
fr: Ignorer les changements d'espace
he: התעלמות משינוי ברווחים

source: Ignore all space
ar: تجاهل جميع المسافات
eo: Ignori ĉian blankspacon
fi: Sivuuta kaikki tyhjemerkit
fr: Ignorer tous les espaces
he: התעלמות מכל הרווחים

source: Ignore space at eol
ar: تجاهل المسافة في نهاية السطر
eo: Ignori spacon ĉe fino de linio (eol)
fi: Sivuuta rivinloppuiset tyhjemerkit
fr: Ignorer les espaces en fin de ligne
he: התעלמות מרווחים בסוף שורות

source: Ignore cr at eol
ar: تجاهل cr في نهاية السطر
eo: Ignoru CR ĉe fino de linio (eol)
fi: Sivuuta rivinloppuinen CR
fr: Ignorer les retours chariot en fin de ligne
he: התעלמות מירידת שורה בסוף השורה

source: <html><head/><body><p>This runs a virtual check-out and check-in of all three stages of a file when resolving a three-way merge. This option is meant to be used when merging branches with different clean filters or end-of-line normalization rules.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-renormalize"><span style=" text-decoration: underline; color:#007af4;">More information</span></a></p></body></html>
ar: <html><head/><body><p>يشغل هذا سحبًا افتراضيًا و إيداعًا افتراضيًا لجميع المراحل الثلاثة لملف عند حل دمج ثلاثي الأطراف. هذا الخيار يهدف إلى استخدامه عند دمج الفروع التي لديها مرشحات تنظيف مختلفة أو قواعد مساواة نهاية السطر.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-renormalize"><span style=" text-decoration: underline; color:#007af4;">مزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Ĉi tio ruligas virtualan kontrolon kaj kontrolon de ĉiuj tri etapoj de dosiero kiam solvas tridirektan kunfandiĝon. Ĉi tiu opcio estas uzata kiam oni kunfandas branĉojn kun malsamaj puraj filtriloj aŭ finliniaj normaligaj reguloj.</p><p><br/></p><p><a href="https:/ /git-scm.com/docs/git-merge#Documentation/git-merge.txt-renormalize"><span style=" text-decoration: underline; color:#007af4;">Pliaj informoj</span ></a></p></body></html>
fr: <html><head/><body><p>Ceci lance une opération virtuelle en trois étapes avec réception et validation pour une fusion tri-partite. Cette option en prévue pour être utilisée lors d'une fusion entre branches avec des filtres de nettoyage ou des règles de normalisation de fin de ligne différents.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-renormalize"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations</span></a></p></body></html>

source: Renormalize
ar: أعد المساواة
eo: Renormigi
fi: Normalisoi uudelleen
fr: Normaliser à nouveau
he: נרמול מחדש

source: Diff algorithm:
ar: خوارزمية الفروقات:
eo: Diff-algoritmo:
fi: Diff-algoritmi:
fr: Algorithme de différence :
he: אלגוריתם הבדלים:

source: <html><head/><body><p>Use a different diff algorithm while merging, which can help avoid mismerges that occur due to unimportant matching lines (such as braces from distinct functions).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-diff-algorithmpatienceminimalhistogrammyers"><span style=" text-decoration: underline; color:#007af4;">More information</span></a></p></body></html>
ar: <html><head/><body><p>استخدم خوارزمية فروقات مختلفة أثناء الدمج، والتي يمكن أن تساعد في تجنب عمليات الدمج الخاطئة التي تحدث بسبب سطور المطابقة غير المهمة (مثل الأقواس المعقوفة من دوال مختلفة).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-diff-algorithmpatienceminimalhistogrammyers"><span style=" text-decoration: underline; color:#007af4;">مزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Uzi malsaman dif-algoritmon dum kunfandado, kio povas helpi eviti miskunfandaĵojn kiuj okazas pro negravaj kongruaj linioj (kiel krampoj de apartaj funkcioj).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-diff-algorithmpatienceminimalhistogrammyers"><span style= " text-decoration: underline; color:#007af4;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Utiliser un autre algorithme de différence pour la fusion, ce qui peut permettre d'éviter des erreurs dues à des correspondances erronées de lignes (telles que des parenthèses de fonctions distinctes).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-diff-algorithmpatienceminimalhistogrammyers"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>להשתמש באלגוריתם הבדלים שונה בזמן, המיזוג, מה שיכול לסייע להימנע ממיזוגים מבולגנים שקורים עקב שורות לא חשובות שתואמות (כגון סוגריים מסולסלים מפונקציות נפרדות).</p><p><br/></p><p><a href="https://git-scm.com/docs/git-merge#Documentation/git-merge.txt-diff-algorithmpatienceminimalhistogrammyers"><span style=" text-decoration: underline; color:#007af4;">פרטים נוספים</span></a></p></body></html>

source: Turn off rename detection
ar: أوقف كشف إعادة التسمية
eo: Malŝalti detekton de alinomado
fi: Poista nimenmuutoksen tunnistus käytöstä
fr: Désactiver la détection de renommage
he: כיבוי זיהוי שינוי שם

source: Select files to merge
ar: اختر الملفات للدمج
eo: Elekti dosierojn por kunfandi
fi: Valitse yhdistettävät tiedostot
fr: Choisissez les fichiers à fusionner
he: בחירת קבצים למיזוג

source: Local file:
ar: ملف محلي:
eo: Loka dosiero:
fi: Paikallinen tiedosto:
fr: Fichier local :
he: קובץ מקומי:

source: Remote file:
ar: ملف بعيد:
eo: Fora dosiero:
fi: Etätiedosto:
fr: Fichier distant :
he: קובץ מרוחק:

source: Base file:
ar: ملف قاعدة:
eo: Baza dosiero:
fi: Pohjatiedosto:
fr: Fichier de base :
he: קובץ בסיס:

source: Note
ar: ملاحظة
eo: Noto
fi: Huomautus
he: הערה

source: Pull changes
ar: اسحب التغييرات
eo: Tiri ŝanĝojn
fi: Tuo muutokset
fr: Sortir les modifications de la file
he: משיכת שינויים

source: Rebase:
ar: أعد الأساس:
eo: Rebazigi:
fi: Pohjaa uudelleen:
fr: Re-localiser :
he: ביסוס מחדש:

source: No commit
ar: لا إيداع
eo: Neniu enmeto
fi: Ei toimitusta
fr: Pas de validation
he: אין קיבוע

source: New remote
ar: بعيد جديد
eo: Nova remote
fi: Uusi etäkohde
fr: Nouveau distant
he: מרוחק חדש

source: Mirror
ar: مرآة
eo: Spegulo
fi: Peili
fr: Miroir
he: מראה

source: Repo settings
ar: إعدادات المستودع
eo: Deponej-agordoj
fi: Lähdeasetukset
fr: Paramètres du dépôt
he: הגדרות מאגר

source: Email:
ar: البريد الإلكتروني:
eo: Retpoŝto:
fi: Sähköposti:
fr: Courriel :
he: דוא״ל:

source: Auto crlf:
ar: crlf آلي:
eo: Aŭtomata CR-LF:
fi: Automaattinen CR/LF:
fr: CR-LF automatique :
he: סוף שורה אוטומטי:
