Repository: KDE/kommit
Catalog: po/*/kommit.po
Languages: ar, eo, fi, fr, he

source: Fast forwardable
ar: قابل للتقديم السريع
eo: Rapide pluŝaltebla
fi: Pikakelattavissa
fr: Avance rapide possible
he: אפשר להריץ קדימה

source: Local out of date
ar: محلي غير محدّث
eo: Loka malaktuala
fi: Paikallinen vanhentunut
fr: Locale obsolète
he: המקומי לא עדכני

# @action
source: Create…
ar: أنشئ…
eo: Krei…
fi: Luo…
he: יצירה…

# @action
source: Browse…
ar: تصفّح…
eo: Foliumi…
fi: Selaa…
he: עיון…

# @action
source: Switch
ar: حوّل
eo: Ŝalti
fr: Basculer
he: החלפה

# @action
source: Diff
ar: فرق
eo: Dif-i
fi: Vertaa
fr: Différences
he: הבדלים

# @action
source: Remove…
ar: أزل…
eo: Forigi…
fi: Poista…
he: הסרה…

# @title:window
source: Create new branch
ar: أنشئ فرعًا جديدًا
eo: Krei novan branĉon
fi: Luo uusi haara
he: יצירת ענף חדש

source: Branch name
ar: اسم الفرع
eo: Nomo de branĉo
fi: Haaran nimi
fr: Nom de la branche
he: שם הענף

source: Are you sure to remove the selected branch?
ar: أتأكد من إزالة الفرع المختار؟
eo: Ĉu vi certas forigi la elektitan branĉon?
fi: Haluatko varmasti poistaa valitun haaran?
fr: Êtes-vous certain de supprimer la branche sélectionnée ?
he: להסיר את הענף הנבחר?

source: Remove Branch
ar: أزل الفرع
eo: Forigi Branĉon
fi: Poista haara
fr: Supprimer une branche
he: הסרת ענף

source: Unable to remove the selected branch
ar: غير قادر على إزالة الفرع المختار
eo: Ne eblas forigi la elektitan branĉon
fi: Valittua haaraa ei voida poistaa
fr: Impossible de supprimer la branche sélectionnée
he: לא ניתן להסיר את הענף הנבחר

# @action
source: Diff…
ar: فرق…
eo: Dif-i…
fi: Vertaa…
he: הבדלים…

# @action
source: Revert…
ar: أرجع…
eo: Malfari…
fi: Palauta…
he: החזרה…

# @action
source: Browse
ar: تصفّح
eo: Foliumi
fi: Selaa
fr: Parcourir
he: עיון

# @action
source: Checkout
ar: انتقل
eo: Elpreni (checkout)
fi: Nouda
fr: Extraire
he: שליפה

# @action
source: Diff with working dir
ar: فرق مع دليل العمل
eo: Dif-i kun labordosierujo
fi: Näytä erot työkansioon
fr: Faire une comparaison avec le dossier de travail
he: הבדלים מול תיקיית העבודה

# @action
source: Note
ar: ملاحظة
eo: Prinoti
fi: Huomautus
fr: Remarque
he: הערה

# @action
source: Preview
ar: معاينة
eo: Antaŭrigardi
fi: Esikatselu
fr: Aperçu
he: תצוגה מקדימה

# @action
source: Open
ar: افتح
eo: Malfermi
fi: Avaa
fr: Ouvrir
he: פתיחה

# @action
source: Open with…
ar: افتح بـ...
eo: Malfermi kun…
fi: Avaa ohjelmalla…
he: פתיחה עם…

# @action
source: Merge with working dir
ar: ادمج مع دليل العمل
eo: Kunfandi kun labordosierujo
fi: Yhdistä työkansioon
fr: Fusionner avec le dossier de travail
he: מיזוג עם תיקיית העבודה

# @action
source: Save as…
ar: احفظ باسم...
eo: Konservi kiel…
fi: Tallenna nimellä…
he: שמירה בשם…

# @action
source: Log
ar: سجل
eo: Protokoli
fi: Loki
fr: Journal
he: יומן

source: %1 file (*.%1);;All files(*)
ar: ملف %1 (*.%1);;جميع الملفات(*)
eo: %1 dosiero (*.%1);;Ĉiuj dosieroj(*)
fi: %1-tiedosto (*.%1);;Kaikki tiedostot (*)
fr: Fichier %1 (*.%1);;Tous les fichiers(*)
he: קובץ %1 (‎*.%1);;כל הקבצים (*)

# @action
source: New…
ar: جديد...
eo: Nova…
fi: Uusi…
he: חדש…

# @action
source: Rename…
ar: أعد التسمية...
eo: Alinomi…
fi: Muuta nimeä…
he: שינוי שם…

# @action
source: Change url…
ar: غير عنوان URL...
eo: Ŝanĝi URL…
fi: Muuta verkko-osoitetta…
he: החלפת כתובת…

source: Unable to create remote
ar: تعذّر إنشاء الطرف البعيد
he: לא ניתן ליצור מרוחק

source: Are you sure to remove the selected remote?
ar: هل أنت متأكد من إزالة الطرف البعيد المحدد؟
eo: Ĉu vi certas forigi la elektitan remote?
fi: Haluatko varmasti poistaa valitun etäkohteen?
fr: Êtes-vous certain de supprimer la référence distante sélectionnée ?
he: להסיר את המרוחק הנוכחי?

source: Remove remote?
ar: أزل الطرف البعيد؟
eo: Ĉu forigi foran?
fi: Poistetaanko etäkohde?
fr: Supprimer la référence distante ?
he: להסיר מרוחק?

source: Unable to remove the selected remote
ar: تعذّر إزالة الطرف البعيد المحدد
eo: Ne eblas forigi la elektitan forilon
fi: Valittua etäkohdetta ei voida poistaa
fr: Impossible de supprimer la branche sélectionnée distante
he: לא ניתן להסיר את המרוחק הנבחר

# @title:window
source: Change url
ar: غير عنوان URL
eo: Ŝanĝi URL
fi: Muuta verkko-osoitetta
he: החלפת כתובת

source: URL
ar: عنوان URL
fi: Verkko-osoite
he: כתובת

source: Url for remote changed successfully
ar: غُيّر عنوان URL للطرف البعيد بنجاح
eo: Url por forilo sukcese ŝanĝita
fi: Etäkohteen verkko-osoitteen muutos onnistui
fr: L'URL de la référence distante modifiée avec succès
he: כתובת המרוחק השתנתה בהצלחה

# @title:window
source: Rename
ar: أعد التسمية
eo: Alinomi
fi: Muuta nimeä
he: שינוי שם

source: New name
ar: اسم جديد
eo: Nova nomo
fi: Uusi nimi
fr: Nouveau nom
he: שם חדש

# @action
source: New stash…
ar: احتياطي جديد...
eo: Nova kaŝejo (stash)…
fi: Uusi jemma…
he: הטמנה חדשה…

# @action
source: Pop…
ar: أزل...
eo: Malpuŝi…
he: שליפה (Pop)…

# @action
source: Apply…
ar: طبق...
eo: Apliki…
fi: Käytä…
he: החלה…

source: Are you sure to apply the selected stash?
ar: هل أنت متأكد من تطبيق الاحتياطي المحدد؟
eo: Ĉu vi certe aplikas la elektitan kaŝejon?
fi: Haluatko varmasti käyttää valittua jemmaa?
fr: Êtes-vous certain d'appliquer la remise sélectionnée ?
he: להחיל את ההטמנה הנבחרת?

source: Apply stash %1
ar: طبق الاحتياطي %1
eo: Apliki stash %1
fi: Käytä jemmaa %1
fr: Appliquer le remisage %1
he: החלת ההטמעה %1

source: Unable to apply the selected stash
ar: تعذّر تطبيق الاحتياطي المحدد
eo: Ne eblas apliki la elektitan kaŝejon
fi: Valittua jemmaa ei voida käyttää
fr: Impossible d'appliquer le remisage sélectionné
he: לא ניתן להחיל את ההטמנה הנבחרת

source: Are you sure to drop the selected stash?
ar: هل أنت متأكد من إسقاط الاحتياطي المحدد؟
eo: Ĉu vi certe forigos la elektitan kaŝejon?
fi: Haluatko varmasti hylätä valitun jemman?
fr: Êtes-vous certain d'appliquer le remisage sélectionné ?
he: להשמיט את ההטמנה הנבחרת?

source: Drop stash %1
ar: أسقط الاحتياطي %1
eo: Forigu kaŝejon %1
fi: Hylkää jemma %1
fr: Appliquer le remisage %1
he: השמטת ההטמנה %1

source: Unable to remove the selected stash
ar: تعذّر إزالة الاحتياطي المحدد
eo: Ne eblas forigi la elektitan kaŝejon
fi: Valittua jemmaa ei voida poistaa
fr: Impossible de supprimer le remisage sélectionné
he: לא ניתן להסיר את ההטמנה הנבחרת

source: Are you sure to pop the selected stash?
ar: هل أنت متأكد من إزالة الاحتياطي المحدد؟
eo: Ĉu vi certe ŝprucas la elektitan kaŝejon?
fi: Haluatko varmasti palauttaa valitun jemman?
fr: Êtes-vous certain d'appliquer le remisage sélectionné ?
he: להקפיץ את ההטמנה הנבחרת?

source: Pop stash %1
ar: أزل الاحتياطي %1
fi: Palauta jemma %1
fr: Appliquer le remisage %1
he: הקפצת ההטמנה %1

source: You don't have any changes!
ar: ليس لديك أية تغييرات!
eo: Vi ne havas ŝanĝojn!
fi: Muutoksia ei ole!
fr: Vous n'avez aucune modification !
he: אין לך שינויים כלל!

# @title:window
source: Stash
ar: احتياطي
eo: Kaŝi (stash)
fi: Kätkö
he: הטמנה

# @title:window
source: Create new stash
ar: أنشئ احتياطيًا جديدًا
eo: Kreu novan kaŝejon
fi: Luo uusi kätkö
he: יצירת הטמנה חדשה

source: Name of stash
ar: اسم الاحتياطي
eo: Nomo de stash
fi: Jemman nimi
fr: Nom de la remise
he: שם ההטמנה

# @action
source: Add…
ar: أضف...
eo: Aldoni…
fi: Lisää…
he: הוספה…

# @action
source: Update…
ar: حدث...
eo: Ĝisdatigi…
fi: Päivitä…
he: עדכון…

# @action
source: Sync…
ar: تزامن...
eo: Sinkronigi…
fi: Tahdista…
he: סנכרון…

# @action
source: New tag…
ar: وسم جديد...
eo: Nova etikedo…
fi: Uusi luokitus…
he: תגית חדשה…

# @action
source: Checkout…
ar: افحص...
eo: Elpreni (checkout)…
fi: Nouda…
he: שליפה…

# @title:window
source: New tag
ar: وسم جديد
eo: Nova etikedo
fi: Uusi tunniste
fr: Nouvelle étiquette
he: תגית חדשה

source: Are you sure to remove the selected tag?
ar: هل أنت متأكد من إزالة الوسم المحدد؟
eo: Ĉu vi certas forigi la elektitan etikedon?
fi: Haluatko varmasti poistaa valitun tunnisteen?
fr: Êtes-vous certain de supprimer l'étiquette sélectionnée ?
he: להסיר את התגית הנוכחית?

source: Remove tag
ar: أزل الوسم
eo: Forigi etikedon
fi: Poista tunniste
fr: Supprimer une étiquette
he: הסרת תגית

source: Are you sure to checkout to the selected tag?
ar: هل أنت متأكد من فحص الوسم المحدد؟
eo: Ĉu vi certas elpreni al la elektita etikedo?
fi: Haluatko varmasti vaihtaa valittuun tunnisteeseen?
fr: Voulez-vous vraiment extraire l'étiquette sélectionnée ?
he: לשלוף את התגית הנבחרת?

# @title:window
source: Checkout
ar: افحص
eo: Elpreni (checkout)
fi: Nouda
he: שליפה

source: Yes
ar: نعم
fi: Kyllä
he: כן

source: No
ar: لا
fi: Ei
he: לא

source: Confirm certificate
ar: أكد الشهادة
fi: Vahvista varmenne
he: הסכמה עם האישור

source: Confirm this certificate by clicking OK, if this is not the correct certificate, click Cancel.
ar: أكد هذه الشهادة بالنقر على 'موافق'، وإذا لم تكن هذه هي الشهادة الصحيحة، فانقر على 'إلغاء'.
fi: Vahvista tämä varmenne napsauttamalla OK tai jos varmenne ei ole oikea, napsauta Peru.
he: יש לאשר את האישור בלחיצה על אישור, אם זה לא האישור הנכון, יש ללחוץ על ביטול.

source: Certificate details
ar: تفاصيل الشهادة
fi: Varmenteen tiedot
he: פרטי אישור

source: Host
ar: المضيف
fi: Palvelin
he: מארח

source: Is valid
ar: صحيحة
fi: Kelvollinen
he: תקף

source: Subject
ar: الموضوع
eo: Temo
fi: Aihe
fr: Sujet
he: נושא

source: Issuer
ar: المُصدر
fi: Julkaisija
he: מנפיק

source: Serial number
ar: الرقم التسلسلي
fi: Sarjanumero
he: מספר סידורי

source: Valid from
ar: صالح من
fi: Kelpaa alkaen
he: תקף החל מ־

source: Valid until
ar: صالح حتى
fi: Kelpaa asti
he: תקף עד

source: Public key type
ar: نوع المفتاح العمومي
fi: Julkisen avaimen tyyppi
he: סוג מפתח ציבורי

source: Public key bits
ar: بتات المفتاح العمومي
fi: Julkisen avaimen bitit
he: סיביות מפתח ציבורי

source: Signature algorithm
ar: خوارزمية التوقيع
fi: Allekirjoitusalgoritmi
he: אלגוריתם החתימה

source: Changed files
ar: الملفات المغيّرة
eo: Ŝanĝitaj dosieroj
fi: Muuttuneet tiedostot
fr: Fichiers modifiés
he: קבצים שהשתנו

source: Changed files:
ar: الملفات المغيّرة:
eo: Ŝanĝitaj dosieroj:
fi: Muuttuneet tiedostot:
fr: Fichiers modifiés :
he: קבצים שהשתנו:

source: Reload
ar: أعد التحميل
eo: Reŝargi
fi: Lataa uudelleen
fr: Recharger
he: ריענון

source: Stash changes
ar: احفظ التغييرات احتياطيًا
eo: Kaŝkonservi ŝanĝojn (stash)
fi: Kätkön muutokset
fr: Mettre de côté les modifications
he: הטמנת השינויים

source: Commit/push
ar: إيداع/دفع
eo: Enmeti/push
fi: Toimita/vie
fr: Valider / Pousser
he: קיבוע/דחיפה

# @title:window
source: Commit/Push submodule: %1
ar: إيداع/دفع الوحدة الفرعية: %1
eo: Enmeti/Puŝi submodulon: %1
fi: Toimita/vie alimoduuli: %1
he: קיבוע/דחיפת תת־מודול: %1

# @action
source: Commit/Push
ar: إيداع/دفع
eo: Enmeti/Puŝi
fi: Toimita/vie
he: קיבוע/דחיפה

source: Changed submodules
ar: الوحدات الفرعية المغيّرة
eo: Ŝanĝitaj submoduloj
fi: Muuttuneet alimoduulit
fr: Sous-modules modifiés
he: תת־מודולים שהשתנו

source: The following submodules are dirty. Would you like to push them?
ar: الوحدات الفرعية التالية مغيّرة. هل ترغب في دفعها؟
eo: La sekvantaj submoduloj estas malpuraj. Ĉu vi ŝatus puŝi ilin?
fi: Seuraavat alimoduulit ovat likaisia. Haluatko viedä ne?
fr: Les sous-modules suivants sont incohérents. Voulez-vous vraiment les intégrer ?
he: תת־המודולים הבאים מלוכלכים. לדחוף אותם?

source: Cleanup repo
ar: نظّف المستودع
eo: Purigi deponejon
fi: Siivoa lähde
fr: Nettoyer le dépôt
he: ניקוי במאגר

source: Clean type
ar: نوع التنظيف
eo: Pura tipo
fi: Siivoa tyyppi
fr: Effacer un type
he: סוג ניקיון

source: Remove non-ignored untracked files
ar: أزل الملفات غير المتتبعة وغير المتجاهَلة
eo: Forigu ne-ignoritajn nespuritajn dosierojn
fi: Poista ei-sivuutetut ei-jäljitetyt tiedostot
fr: Supprimer les fichiers non suivis et non ignorés
he: הסרת כל הקבצים שאינם במעקב ואינם בהתעלמות

source: Remove all untracked files
ar: أزل جميع الملفات غير المتتبعة
eo: Forigu ĉiujn nespuritajn dosierojn
fi: Poista kaikki ei-jäljitetyt tiedostot
fr: Supprimer tous les fichiers non suivis
he: הסרת כל הקבצים שאינם במעקב

source: Remove ignored files
ar: أزل الملفات المتجاهلة
eo: Forigu ignoritajn dosierojn
fi: Poista sivuutetut tiedostot
fr: Supprimer les fichiers ignorés
he: הסרת קבצים בהתעלמות

source: Remove untracked directories
ar: أزل الأدلة غير المتتبعة
eo: Forigi nespuritajn dosierujojn
fi: Poista ei-jäljitetyt kansiot
fr: Supprimer les dossiers non suivis
he: הסרת תיקיות שאינן במעקב

source: Clone a repository
ar: انسخ مستودعًا
eo: Klonu deponejon
fi: Monista lähde
fr: Cloner un dépôt
he: שיבוט מאגר

source: Url:
ar: عنوان URL:
fi: Verkko-osoite:
he: כתובת:

source: Directory:
ar: الدليل:
eo: Dosierujo:
fi: Kansio:
fr: Dossier :
he: תיקייה:

source: Recursive
ar: تكراري
eo: Rikura
fi: Rekursiivinen
fr: Récursif
he: רקורסיבי

source: Depth
ar: عمق
eo: Profundo
fi: Syvyys
fr: Profondeur
he: עומק

source: Branch
ar: فرع
eo: Branĉo
fi: Haara
fr: Branche
he: ענף

source: Origin name
ar: اسم الأصل
eo: Origina nomo
fi: Alkuperän nimi
fr: Nom d'origine
he: שם מקור

source: Cloning into:
ar: يُنسخ إلى:
eo: Klonante en:
fi: Monistetaan kohteeseen:
fr: Cloner dans :
he: שיבוט אל:

source: TextLabel
ar: لصيقة نصية
eo: TekstEtikedo
fi: Tekstiselite
fr: Étiquette de texte
he: תווית טקסט

source: Commit and push
ar: أودع وادفع
eo: Enmeti kaj puŝi
fi: Toimita ja vie
fr: Valider et pousser
he: קיבוע ודחיפה

source: Commit/Push
ar: إيداع/دفع
eo: Enmeti/Puŝi
fi: Toimita/vie
fr: Valider/Pousser
he: קיבוע/דחיפה

source: Remote:
ar: بعيد:
fi: Etäkohde:
fr: Distant :
he: מרוחק:

source: Current branch
ar: الفرع الحالي
eo: Aktuala branĉo
fi: Nykyinen haara
fr: Branche courante
he: ענף נוכחי

source: Existing branch
ar: فرع موجود
eo: Ekzistanta branĉo
fi: Olemassa oleva haara
fr: Branche existante
he: ענף קיים

source: New branch
ar: فرع جديد
eo: Nova branĉo
fi: Uusi haara
fr: Nouvelle branche
he: ענף חדש

source: <html><head/><body><p>Usually, the command refuses to update a remote ref that is not an ancestor of the local ref used to overwrite it. Also, when --force-with-lease option is used, the command refuses to update a remote ref whose current value does not match what is expected.</p><p>This flag disables these checks, and can cause the remote repository to lose commits; use it with care.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-push#Documentation/git-push.txt--f"><span style=" text-decoration: underline; color:#007af4;">More information...</span></a></p></body></html>
ar: <html><head/><body><p>عادة، يرفض الأمر تحديث مرجع بعيد ليس سلفًا للمرجع المحلي المستخدَم لكتابة فوقه. كذلك، عند استعمال خيار --force-with-lease، يرفض الأمر تحديث مرجع بعيد لا تتطابق قيمته الحالية مع المتوقعة.</p><p>تعلّم هذه العلامة تعطّل هذه الفحوص، ويمكنها أن تتسبب في فقدان المستودع البعيد للإيداعات؛ استعملها بحذر.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-push#Documentation/git-push.txt--f"><span style=" text-decoration: underline; color:#007af4;">المزيد من المعلومات...</span></a></p></body></html>
eo: <html><head/><body><p>Kutime, la komando rifuzas ĝisdatigi foran ref, kiu ne estas praulo de la loka ref uzata por anstataŭigi ĝin. Ankaŭ, kiam --force-with-lease opcio estas uzata, la komando rifuzas ĝisdatigi foran ref, kies nuna valoro ne kongruas kun kio estas atendata.</p><p>Tiu flago malŝaltas ĉi tiujn kontrolojn, kaj povas kaŭzi la foran deponejon perdi enmetojn; uzu ĝin zorgeme.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-push#Documentation/git-push.txt--f"><span style="text-decoration: underline; color:#007af4;">Pliaj informoj...</span></a></p></body></html>
fr: <html><head/><body><p>Habituellement, la commande refuse de mettre à jour une référence distante qui n'est pas un ancêtre de la référence locale. Également, quand l'option --force-with-lease option est utilisée, la commande refuse de mettre à jour une référence distante dont la valeur courante ne correspond pas à ce qui est attendu.</p><p>Cette balise désactive ces vérifications, et peut provoquer des pertes dans le dépôt distant ; utilisez avec précautions.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-push#Documentation/git-push.txt--f"><span style=" text-decoration: underline; color:#007af4;">Plus d'informations…</span></a></p></body></html>
he: <html><head/><body><p>בדרך כלל, הפקודה מסרבת לעדכן הפניה מרוחקת שאינה צאצאית של ההפניה המקומי ששימשה לדרוס אותה. כמו כן, כשנעשה שימוש ב־‎--force-with-lease, הפקודה מסרבת לעדכן את ההפניה המרוחק שהערך הנוכחי שלה לא תואם את הצפוי.</p><p>הדגלון הזה משבית את הבדיקות האלה, ויכול לגרום למאגר המרוחק לאבד קיבועים, יש להשתמש בו בזהירות.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-push#Documentation/git-push.txt--f"><span style=" text-decoration: underline; color:#007af4;">פרטים נוספים…</span></a></p></body></html>

source: Force
ar: إجبار
eo: Devigi
fi: Pakota
fr: Forcer
he: בכוח

source: Create a commit
ar: أنشئ إيداعًا
eo: Krei enmeton
fi: Luo toimitus
fr: Créer une validation
he: יצירת קיבוע

source: <html><head/><body><p>Include the output of &quot;git status&quot; in the commit message template when using an editor to prepare the commit message. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---status"><span style=" text-decoration: underline; color:#2980b9;">More information</span></a></p></body></html>
ar: <html><head/><body><p>أدرج ناتج &quot;git status&quot; في قالب رسالة الإيداع عند استعمال محرر لتجهيز رسالة الإيداع.</p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---status"><span style=" text-decoration: underline; color:#2980b9;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Inkluzivi la eliron de "git status" en la ŝablonon pri enmeta mesaĝo kiam vi uzas redaktilon por prepari la enmetmesaĝon.</p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---status"><span style=" text--decoration: underline; color:#2980b9;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Inclure la sortie de &quot;git status&quot; dans le modèle de message de validation si on utilise un éditeur pour préparer le message de validation. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---status"><span style=" text-decoration: underline; color:#2980b9;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>לכלול את הפלט של &quot;git status&quot; בתבנית הודעת הקיבוע בעת שימוש בעורך להכנת הודעת הקיבוע. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---status"><span style=" text-decoration: underline; color:#2980b9;">More information</span></a></p></body></html>

source: Include status to the message
ar: أدرج الحالة في الرسالة
eo: Inkluzivi statuson al la mesaĝo
fi: Sisällytä viestiin tila
fr: Inclure l'état au message
he: לכלול מצב בהודעה

source: <html><head/><body><p>Replace the tip of the current branch by creating a new commit.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---amend"><span style=" text-decoration: underline; color:#2980b9;">More info</span></a></p></body></html>
ar: <html><head/><body><p>استبدل طرف الفرع الحالي بإنشاء إيداع جديد.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---amend"><span style=" text-decoration: underline; color:#2980b9;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Anstataŭigi la pinton de la nuna branĉo kreante novan enmeton.</p><p><br/></p><p><a href=" https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---amend"><span style=" text-decoration: underline; color:#2980b9;"> Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Remplacer l'astuce de la branche courante en créant une nouvelle validation.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---amend"><span style=" text-decoration: underline; color:#2980b9;">Plus d'info</span></a></p></body></html>
he: <html><head/><body><p>יש להחליף את קצה הענף הנוכחי על ידי יצירת קיבוע חדש.</p><p><br/></p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---amend"><span style=" text-decoration: underline; color:#2980b9;">פרטים נוספים</span></a></p></body></html>

source: Amend to previous commit
ar: عدّل على الإيداع السابق
eo: Ŝanĝi al antaŭa enmeto
fi: Täydennä aiempaa toimitusta
fr: Amender la validation précédente
he: שילוב עם הקיבוע הקודם

source: Message:
ar: الرسالة:
eo: Mesaĝo:
fi: Viesti:
he: הודעה:

source: <html><head/><body><p>Use the given text as the commit message. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---messageltmsggt"><span style=" text-decoration: underline; color:#2980b9;">More information</span></a></p></body></html>
ar: <html><head/><body><p>استعمل النص المُعطى كرسالة الإيداع.</p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---messageltmsggt"><span style=" text-decoration: underline; color:#2980b9;">المزيد من المعلومات</span></a></p></body></html>
eo: <html><head/><body><p>Uzi la donitan tekston kiel la mesaĝo. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---messageltmsggt"><span style=" text-decoration: underline; color:#2980b9;">Pliaj informoj</span></a></p></body></html>
fr: <html><head/><body><p>Utiliser le texte comme message de validation. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---messageltmsggt"><span style=" text-decoration: underline; color:#2980b9;">Plus d'informations</span></a></p></body></html>
he: <html><head/><body><p>להשתמש בטקסט שסופק כהודעת קיבוע. </p><p><a href="https://git-scm.com/docs/git-commit#Documentation/git-commit.txt---messageltmsggt"><span style=" text-decoration: underline; color:#2980b9;">פרטים נוספים</span></a></p></body></html>

source: Files:
ar: الملفات:
eo: Dosieroj:
fi: Tiedostot:
fr: Fichiers :
he: קבצים:

source: Indexed
ar: مفهرَس
eo: Indeksita
fi: Indeksoitu
fr: Indexés
he: מסודר במפתח

source: Added
ar: مضاف
eo: Aldonita
fi: Lisätty
fr: Ajoutés
he: מועד הוספה

source: Modified
ar: معدّل
eo: Modifita
fi: Muutettu
fr: Modifiés
he: מועד שינוי

source: None
ar: لا شيء
eo: Neniu
fi: Ei mitään
fr: Aucun
he: אין

source: Commit
ar: إيداع
eo: Enmeto
fi: Toimita
fr: Validation
he: קיבוע

source: Credential for %1
ar: بيانات الاعتماد لـ %1
eo: Akreditaĵo por %1
fr: Identifiants pour %1
he: פרטי גישה עבור %1

source: Credential input
ar: إدخال بيانات الاعتماد
he: קלט פרטי גישה

source: Credentials:
ar: بيانات الاعتماد:
eo: Akreditaĵoj:
fr: Identifiants :
he: פרטי גישה:

source: Username:
ar: اسم المستخدم:
eo: Uzantnomo:
fi: Käyttäjätunnus:
fr: Nom d'utilisateur :
he: שם משתמש:

source: Password:
ar: كلمة السر:
eo: Pasvorto:
fi: Salasana:
fr: Mot de passe :
he: סיסמה:

source: Select files/folders
ar: اختر الملفات/المجلدات
eo: Elekti dosierojn/dosierujojn
fi: Valitse tiedostot tai kansiot
fr: Sélectionner des fichiers et des dossiers
he: בחירת קבצים/תיקיות

source: Compare files
ar: قارن الملفات
eo: Kompari dosierojn
fi: Vertaa tiedostoja
fr: Comparer les fichiers
he: השוואת קבצים

source: Compare directories
ar: قارن الأدلة
eo: Kompari dosierujojn
fi: Vertaa kansioita
fr: Comparer les dossiers
he: השוואת תיקיות

source: Old file:
ar: الملف القديم:
eo: Malnova dosiero:
fi: Vanha tiedosto:
fr: Ancien fichier :
he: קובץ ישן:

source: New file:
ar: الملف الجديد:
eo: Nova dosiero:
fi: Uusi tiedosto:
fr: Nouveau fichier :
he: קובץ חדש:

source: New directory:
ar: الدليل الجديد:
eo: Nova dosierujo:
fi: Uusi kansio:
fr: Nouveau dossier :
he: תיקייה חדשה:

source: Old directory:
ar: الدليل القديم:
eo: Malnova dosierujo:
fi: Vanha kansio:
fr: Ancien dossier :
he: תיקייה ישנה:

source: Receiving objects
ar: استقبل الكائنات
fi: Vastaanotetaan kohteita
he: פריטים מתקבלים

source: Stage %1
ar: المرحلة %1
fi: Vaihe %1
he: שלב %1

source: Reference updated: %1 %2...%3
ar: حُدّث المرجع: %1 %2...%3
fi: Viite päivitetty: %1 %2…%3
he: ההפניה עודכנה: %1 %2...%3

source: Finished
ar: انتهى
fi: Valmis
he: הסתיים

source: Finished with error
ar: انتهى بخطأ
fi: Päättyi virheeseen
he: הסתיים עם שגיאה
